[
  {
    "title": "Pit Chaos Handling with Passes",
    "video_url": "https://vimeo.com/858767129",
    "image_url": "https://www.files.icehockeysystems.com/files/drills/drill-maker-2625946-0-1729699956.png",
    "author": "Global Hockey Network",
    "summary": "The Pit Chaos Handling With Passing drill is an excellent activity that helps players work on awareness, puck handling, and passing skills. This drill can be used as a warm-up in practice or games, or as a drill to reinforce keeping your head up.",
    "setup": [
      "Setup 2, 3, or 4 players in the middle of a face-off circle. The more players involved will increase the difficulty of the drill because there will be more skaters to pass & stickhandle around.",
      "Setup 3 or 4 players around the outside of a circle.",
      "On the whistle, the players in the middle of the circle begin stickhandling within the border of the circle. The players on the outside begin passing the puck to each other.",
      "After 20-30 seconds, players rotate."
    ],
    "coaching_points": [
      "Encourage players to keep their heads up and scan the ice.",
      "Players stickhandling should work to get to open space.",
      "Players passing the puck scan the ice and think ahead as to where they would pass the puck before they get it."
    ],
    "variations": [
      "Can set up in different areas of the ice.",
      "Coaches can require two touch or one touch passes for higher skilled groups.",
      "Can increase or decrease the # of players involved. More players inside the circle will make the drill more challenging."
    ],
    "tags": [
      "Awareness",
      "Half Ice",
      "Passing",
      "Pre Game",
      "Puck Control",
      "Puck Handling",
      "Puck Protection",
      "Skill Development",
      "Stations",
      "Quarter Ice Station",
      "Stickhandling",
      "Warm Up"
    ],
    "source": "IHS",
    "members_only": false
  },
  {
    "title": "Corner to Half Wall 2 vs 1",
    "video_url": "https://vimeo.com/359069890",
    "image_url": "https://www.files.icehockeysystems.com/files/styles/medium/public/drills/drill-maker-7183266-0-1750945059.png?itok=Vx3lkDiP",
    "author": "Ice Hockey Systems",
    "summary": "The Corner to Half Wall 2 vs 1 is an excellent small area game for all age levels that helps players practice a 2 vs 1 in a small space along the boards in the corner of the ice. The game reinforces important skills like keeping your head up, moving to open spaces, protecting the puck, and verbal & non-verbal communication.Offensive players should practice using the boards to make bank passes.",
    "setup": [
      "Playing Area:Use 4 cones or tires that create a triangle from the half wall to the corner that lines up with the inside post.",
      "Goalie Setup:This can be set up as a station with a goalie, or without. If you use a goalie they can be placed in the crease or the net can be moved to the point.",
      "Players:Alternate players. It is beneficial for players to get reps on both offense and defense sides.",
      "Passes:You can require 4 (or a different amount) of consecutive passes to win.",
      "Defense:If the defense is taking the puck away too much, you can tell the defense to flip their stick over.",
      "Winner:The winning side gets a shot on net. You can allow the winners to do a few options:If the offense wins:The last person with the puck gets a shot on net.Both players are given a puck and can shoot on different goalies.The game moves to a 2 vs 1 in front of the net and offense is allowed one shot if they can get it off.If the defense wins:They get a shot on net.The game moves to a 1 on 1 in front of the net and the defense is allowed one shot if they can get it off. The losing offense team needs to communicate with each other as to who is going to go after the defense.",
      "If the offense wins:The last person with the puck gets a shot on net.Both players are given a puck and can shoot on different goalies.The game moves to a 2 vs 1 in front of the net and offense is allowed one shot if they can get it off.",
      "The last person with the puck gets a shot on net.",
      "Both players are given a puck and can shoot on different goalies.",
      "The game moves to a 2 vs 1 in front of the net and offense is allowed one shot if they can get it off.",
      "If the defense wins:They get a shot on net.The game moves to a 1 on 1 in front of the net and the defense is allowed one shot if they can get it off. The losing offense team needs to communicate with each other as to who is going to go after the defense.",
      "They get a shot on net.",
      "The game moves to a 1 on 1 in front of the net and the defense is allowed one shot if they can get it off. The losing offense team needs to communicate with each other as to who is going to go after the defense."
    ],
    "coaching_points": [
      "Use the boards! They are your friend!If used properly, the boards can be used as an extra player out there and are helpful for bank passes and puck protection.",
      "If used properly, the boards can be used as an extra player out there and are helpful for bank passes and puck protection.",
      "Offensive players need to protect the puck until they can make a play and then expose the puck to make a pass.",
      "Offensive players have to move without the puck. Think \"Give & Go!\" Go to open space!",
      "Defensive players are most successful with active sticks and stop and starts. There are no short cuts!"
    ],
    "variations": [
      "Require more consecutive passes.",
      "Make the game 2 vs 2.",
      "Create a smaller \"playing area\" to make it tougher on the offense.",
      "Move to thePoint to Half Wall 2 vs 1 Game."
    ],
    "tags": [
      "2 on 1",
      "Battle Drills",
      "Half Ice",
      "Offensive",
      "Small Area Games",
      "Stations",
      "Wall Play"
    ],
    "source": "IHS",
    "members_only": false
  },
  {
    "title": "Swedish 2 vs 1 (Cross Ice)",
    "video_url": "https://vimeo.com/342763238",
    "image_url": "https://www.files.icehockeysystems.com/files/drills/drill-maker-99301-0-1721412866.png",
    "author": "Ice Hockey Systems",
    "summary": "This is a phenomenal drill in several ways. First, the concept of this drill can be used in many different areas of the ice. Secondly, it forces players to think 2 on 1's in tight spaces. Third, it includes a competitive aspect by rewarding the players who are successful.",
    "setup": [],
    "coaching_points": [
      "Offensive players have to move without the puck.",
      "Offensive players need to protect the puck until they can make a play and then expose the puck to make a pass.",
      "Defensive players are most successful with active sticks and stop and starts. There really are no short cuts!",
      "Have offensive players thinking \"Pass & Move\".",
      "Give & gos are very successful in this game."
    ],
    "variations": [
      "Create a smaller \"playing area\" to make it tougher on the offense.",
      "Vary the number of passes required for the offensive players.",
      "Eventually, make the game 2 vs 2 or 3 vs 2."
    ],
    "tags": [
      "2 on 1",
      "Small Area Games",
      "Stations",
      "Third Ice Stations"
    ],
    "source": "IHS",
    "members_only": false
  },
  {
    "title": "Paint Scoring",
    "video_url": "https://vimeo.com/421339717/9be3db1982",
    "image_url": "https://www.files.icehockeysystems.com/files/drills/drill-maker-150271-0-1743905436.png",
    "author": "Newedge Hockey",
    "summary": "The Paint Scoring Drill is one where players will see how fast they can score three pucks. Players will be able to work on finishing using backhands, one timers, and wrist/snap shots. To set up the drill place a couple barriers stacked on top of each other in front of the net. Another net placed face down (or another type of object that you can use to bounce pucks off of) at about the hash marks directly in front of the net. The first player starts about a sticl length away from the face down net and the drill operates as follows:",
    "setup": [],
    "coaching_points": [],
    "variations": [],
    "tags": [
      "Offensive",
      "Shooting",
      "Stations",
      "Sixth Ice Stations"
    ],
    "source": "IHS",
    "members_only": false
  },
  {
    "title": "Gates of Buffalo Small Area Passing Game",
    "video_url": "https://vimeo.com/356044514/7ec320c386",
    "image_url": "https://www.files.icehockeysystems.com/files/drills/drill-maker-103971-0-1744828737.png",
    "author": "Ice Hockey Systems",
    "summary": "The major concept of the Gates of Buffalo Small Area Hockey Game is to practice moving to open space, communicating verbally and non-verbally with teammates, so they can score Goals by passing through Gates.",
    "setup": [
      "Players:great for 3, 4 or 5 players at a time.",
      "Time:You can rotate through groups of players in 30, 45 or 60 second shifts and count how many goals are scored.Or you can set a number of goals (let's use 5 for example) and stop the watch after 5 goals are completed.5 players can be participating in the activity, while another 5 rest. Blow the whistle and the next 5 jump in.It gets fun when the teams compete against each other!",
      "Or you can set a number of goals (let's use 5 for example) and stop the watch after 5 goals are completed.",
      "5 players can be participating in the activity, while another 5 rest. Blow the whistle and the next 5 jump in.It gets fun when the teams compete against each other!",
      "Space:can be set up to be within a zone, or half of a zone (station) or a smaller area. The smaller the space, the more challenging it will be for the players as they are forced to make quicker decisions.",
      "Added Challenge:add obstacles within the space to challenge the players further.Tires, cones, sticks, defenceman, etc placed in the space will make it harder to pass and skate around. As time goes on the added obstacles will help improve their reaction & decision making.",
      "Tires, cones, sticks, defenceman, etc placed in the space will make it harder to pass and skate around. As time goes on the added obstacles will help improve their reaction & decision making.",
      "Group Competition:After the group gets comfortable with the exercises, you can add a natural element of competition between the groups by counting the number of successful goals made in the specified amount of time.Or you can time each group and see how fast they can complete 5 (or any other number) goals. You will marvel at how the natural element of competition between groups will make the game more intense, competitive and fun!",
      "Or you can time each group and see how fast they can complete 5 (or any other number) goals. You will marvel at how the natural element of competition between groups will make the game more intense, competitive and fun!",
      "With a Goalie:You can require the players to make 2 (or more) passes through a gate before they can shoot on net. After they shoot on net, they need to make the required number of passes through the gates again.",
      "Pucks:You can add in 2 or more pucks at a time to make players pay more attention to the game and their surroundings.",
      "Gates:You can add 3 or more gates. They can be made of tires, cones, pucks and other materials. Change up the sizes of the gates for an extra challenge. The smaller the gate, the more challenging the game is!",
      "3 vs 3 Game:You can setup gates and make the game 3 v 3, 3 vs 2, or 3 vs 1 so there is another team working to prevent scoring on the gates. Adding additional players for the team to play against will give the game a whole new spin.View a video demo of the 3 vs 3 game setup."
    ],
    "coaching_points": [
      "Encourage players to always move to open space on the ice. Do not allow them to stand still and pass the puck back and forth.",
      "Encourage players to find \"passing lanes\" to allow good passes.This skill is extremely valuable for youth players to work on. Finding passing lanes when you have the puck and jumping to open space when you don't have the puck so your teammate can pass to you is extremely beneficial during games.",
      "This skill is extremely valuable for youth players to work on. Finding passing lanes when you have the puck and jumping to open space when you don't have the puck so your teammate can pass to you is extremely beneficial during games.",
      "Encourage verbal communication (calling teammate by name, saying you are open, etc).",
      "Encourage non-verbal communication (good eye contact, showing a passing target, tapping a stick, etc).",
      "Allow players to make mistakes.It will take time to get comfortable with these activities. But as time goes on you will see them picking their head up to make a decision, which is the goal of this small area game."
    ],
    "variations": [],
    "tags": [
      "Half Ice",
      "Passing",
      "Puck Control",
      "Small Area Games",
      "Stations",
      "Warm Up"
    ],
    "source": "IHS",
    "members_only": false
  }
]