[
  {
    "title": "1 on 1 Swedish Overspeed Drill",
    "url": "https://weisstechhockey.com/1-on-1-swedish-overspeed-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/12/1on1swedishoverspeed1.jpg",
    "video_url": "https://www.youtube.com/embed/e3E-CRB50II?wmode=transparent",
    "instructions": "In this drill, we develop passing, skating, gap control, and a number of other skills. This drill can also be developed into a regroup drill (see Option 2). Here’s the diagram and explanation:\n1 on 1 Swedish Overspeed Drill:\nOPTION 11. On the whistle, the F makes a pass to the D.2. The F skates across the ice and receives a return pass.3. The D follows up the ice.4. The F skates around the centre ice circle and goes 1 on 1 with the D.\nOPTION 21. After the F skates around the centre ice circle, the F makes a pass to the D, and turns to the boards.2. The D makes a board pass and closes the gap in the neutral zone.3. The F turns back for a 1 on 1.",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "3 on 0, 3 on 1, 3 on 2 Drill",
    "url": "https://weisstechhockey.com/3-on-0-3-on-1-3-on-2-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/3on0-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/RW8_mA4dY88?wmode=transparent",
    "instructions": "What’s up guys!! I got an interesting email the other day from Mika from Australia. Because of the size of his local rink, and the limited number of players there, they play 3 on 3 (which sounds like a blast to me!). Anyways, he asked if I had any drills that focused on 3-man set-ups and game situations… this drill immediately came to mind!\nIt’s a great drill for imitating odd-man rush scenarios, and is also GREAT conditioning for the forwards. Here’s the explanation and diagram:\n3 on 0, 3 on 1, 3 on 2\n1. Forwards in one bench, Defensemen in the other2. On whistle, 3 Forwards swing low and receive a breakout pass from the Coach, then attack 3 on 03. After a quick attack, the same 3 Forwards swing to present themselves again for a breakout, while a Defenseman closes the gap.4. Coach initiates breakout and Forwards attack 3 on 1.5. After the 3 on 1, the same Forwards will swing again, receive athird breakout pass, then attack 3 on 2.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "3 on 3 \"D\" Support",
    "url": "https://weisstechhockey.com/3-on-3-d-support/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/12/3on3dsupport-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/yjHshsNLs8I?wmode=transparent",
    "instructions": "This small area game drill give players a chance to work on quick transitions, give and go passes and set-ups, and swinging to become a passing option. It’s a fantastic drill that can be used by teams at almost any level! Here’s the diagram:\n3 on 3 “D” Support\n1. Forwards battle 3 on 3 in NZ, but can’t pass imaginary goal line.2. If puck passes goal line, respective defenseman must break it out (he can grab a new puck to keep up the pace).3. Forwards must swing to get open. Opposing forwards can pressure Defenseman, but can’t cross line.4. Defenseman can’t cross line either.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Anaheim 2 on 1 Drill",
    "url": "https://weisstechhockey.com/anaheim-2-on-1-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/anaheim-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/QABWE7ysAwc?wmode=transparent",
    "instructions": "I have been getting really good usage out of the Scott Fukami drill collections. These drill collections are phenomenal, and are filled with hundreds of REALLY GOOD, well-drawn drills. If you own DrillDraw, I highly recommend picking up all the drill sets.\nAnaheim 2 on 1 Drill\n**Drill starts on the whistle. Both ends at the same time.\n1. On the whistle, the (F) makes a pass to the (D).2. The (D) makes a return pass to the (F).3. The (F) makes a pass to the second (F).4. 2 on 1 back.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Bednar Escape Race",
    "url": "https://weisstechhockey.com/bednar-escape-race/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2015/01/bednar_escape.jpg",
    "video_url": "https://www.youtube.com/embed/GPvKv8gi18I?wmode=transparent",
    "instructions": "I picked this one up from by good friend Jan Bednar, out in Slovakia. This one is great for full-speed agility skating, and works power turns and pivots, forward and backward.\nBednar Escape Race:1. On whistle, first player from each corner leaves and skates the route shown2. Full power turns around each cone, pivot backwards around the bottom quarter of the circle3. Race to the puck, player who gets there first shoots, other player backchecks",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  }
]