[
  {
    "title": "1 on 1 Swedish Overspeed Drill",
    "url": "https://weisstechhockey.com/1-on-1-swedish-overspeed-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/12/1on1swedishoverspeed1.jpg",
    "video_url": "https://www.youtube.com/embed/e3E-CRB50II?wmode=transparent",
    "instructions": "In this drill, we develop passing, skating, gap control, and a number of other skills. This drill can also be developed into a regroup drill (see Option 2). Here’s the diagram and explanation:\n1 on 1 Swedish Overspeed Drill:\nOPTION 11. On the whistle, the F makes a pass to the D.2. The F skates across the ice and receives a return pass.3. The D follows up the ice.4. The F skates around the centre ice circle and goes 1 on 1 with the D.\nOPTION 21. After the F skates around the centre ice circle, the F makes a pass to the D, and turns to the boards.2. The D makes a board pass and closes the gap in the neutral zone.3. The F turns back for a 1 on 1.",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "3 on 0, 3 on 1, 3 on 2 Drill",
    "url": "https://weisstechhockey.com/3-on-0-3-on-1-3-on-2-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/3on0-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/RW8_mA4dY88?wmode=transparent",
    "instructions": "What’s up guys!! I got an interesting email the other day from Mika from Australia. Because of the size of his local rink, and the limited number of players there, they play 3 on 3 (which sounds like a blast to me!). Anyways, he asked if I had any drills that focused on 3-man set-ups and game situations… this drill immediately came to mind!\nIt’s a great drill for imitating odd-man rush scenarios, and is also GREAT conditioning for the forwards. Here’s the explanation and diagram:\n3 on 0, 3 on 1, 3 on 2\n1. Forwards in one bench, Defensemen in the other2. On whistle, 3 Forwards swing low and receive a breakout pass from the Coach, then attack 3 on 03. After a quick attack, the same 3 Forwards swing to present themselves again for a breakout, while a Defenseman closes the gap.4. Coach initiates breakout and Forwards attack 3 on 1.5. After the 3 on 1, the same Forwards will swing again, receive athird breakout pass, then attack 3 on 2.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "3 on 3 \"D\" Support",
    "url": "https://weisstechhockey.com/3-on-3-d-support/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/12/3on3dsupport-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/yjHshsNLs8I?wmode=transparent",
    "instructions": "This small area game drill give players a chance to work on quick transitions, give and go passes and set-ups, and swinging to become a passing option. It’s a fantastic drill that can be used by teams at almost any level! Here’s the diagram:\n3 on 3 “D” Support\n1. Forwards battle 3 on 3 in NZ, but can’t pass imaginary goal line.2. If puck passes goal line, respective defenseman must break it out (he can grab a new puck to keep up the pace).3. Forwards must swing to get open. Opposing forwards can pressure Defenseman, but can’t cross line.4. Defenseman can’t cross line either.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Anaheim 2 on 1 Drill",
    "url": "https://weisstechhockey.com/anaheim-2-on-1-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/anaheim-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/QABWE7ysAwc?wmode=transparent",
    "instructions": "I have been getting really good usage out of the Scott Fukami drill collections. These drill collections are phenomenal, and are filled with hundreds of REALLY GOOD, well-drawn drills. If you own DrillDraw, I highly recommend picking up all the drill sets.\nAnaheim 2 on 1 Drill\n**Drill starts on the whistle. Both ends at the same time.\n1. On the whistle, the (F) makes a pass to the (D).2. The (D) makes a return pass to the (F).3. The (F) makes a pass to the second (F).4. 2 on 1 back.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Bednar Escape Race",
    "url": "https://weisstechhockey.com/bednar-escape-race/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2015/01/bednar_escape.jpg",
    "video_url": "https://www.youtube.com/embed/GPvKv8gi18I?wmode=transparent",
    "instructions": "I picked this one up from by good friend Jan Bednar, out in Slovakia. This one is great for full-speed agility skating, and works power turns and pivots, forward and backward.\nBednar Escape Race:1. On whistle, first player from each corner leaves and skates the route shown2. Full power turns around each cone, pivot backwards around the bottom quarter of the circle3. Race to the puck, player who gets there first shoots, other player backchecks",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Burkart 2 on 2 Deflection",
    "url": "https://weisstechhockey.com/burkhart-2-on-2-deflection/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2013/04/Neutral-Zone-Trap-Clarification-YouTube.png",
    "video_url": "https://www.youtube.com/embed/g56NFAXWaro?wmode=transparent",
    "instructions": "My good buddy, and assistant coach, Josh Burkart showed this one to me a couple of years ago. It’s a solid drill that has a pretty quick rotation, so not much standing around once your players pick up the flow of it. Here’s the diagram:\nBurkhart 2 on 2 Deflection Drill\n1. (F) passes to (D) then drives net2. D to D pass and shot3. (F) deflects, then stays in front4. Other corner passes out to (D) then drives net5. D to D pass and shot6. Other (F) deflects7. (F)’s swing for a breakout pass then attack 2 on 28. After second shot, (D)’s back up 2 on 2\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Burkart Regroup Drill",
    "url": "https://weisstechhockey.com/burkart-regroup-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/04/burkartregroup-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/4lkTkypqw1Q?wmode=transparent",
    "instructions": "This is a great little hockey regroup drill that can be converted into a 1 on 1 as your players progress. Here’s the diagram and explanation:\nBurkart Regroup1. (F) passes to (D) and swings2. D to D pass, then back to the Forward3. (F) receives pass, then executes another regroup with other set of defensemen4. (F) attacks 1 on 0\nVariation: have the (D) play the (F) 1 on 1\nEnjoy!!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Center Boundary 2 on 1",
    "url": "https://weisstechhockey.com/center-boundary-2-on-1/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/12/centerboundary-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Yn71yaNZi5Q?wmode=transparent",
    "instructions": "The Center Boundary 2 on 1 is a fabulous small area game drill that works on quick transitions and 2 on 1’s in tight areas. Since there are 6 players participating at once, there isn’t a lot of waiting around between turns. Keep the “shifts” short; around a minute, and make sure the players are going hard the entire time! Here’s the explanation and diagram:\nCenter Line Boundary 2 on 1\n1. Set up a 2 on 1 in each side.2. Nobody can cross the center line.3. When the defender gets the puck back, he/she must pass the puck across the line to the forwards on the other side.\nStart with 2 on 1, work up to 3 on 2.\nEnjoy!!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Center Pass for Mites & Squirts",
    "url": "https://weisstechhockey.com/center-pass-mites-squirts/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2013/11/center_pass2.jpg",
    "video_url": "https://www.youtube.com/embed/l39ax8BV1B0?wmode=transparent",
    "instructions": "I’ve been using this drill with my Mite team this year, and have already seen the kids executing it in our games! In the video I show two variations, but you can make more adaptations as you see fit. Here’s the diagram and explanation:\nCenter PassVariation 1:1. Coach dumps the puck into the corner2. First player in white line goes and gets it3. Next player in line goes to the front of the net4. Pass out from the corner, shot on goal\nVariation 2:1. Coach dumps the puck into the corner2. First player in white line goes and gets it3. One white and one blue drive the net, white trying to get open, blue trying to defend by lifting the white’s stick4. Player from the corner can either pass out front, or shoot",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Coach Regroup 2 on 0",
    "url": "https://weisstechhockey.com/coach-regroup-2-on-0/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/12/coachregroup-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/jumL-dGiWek?wmode=transparent",
    "instructions": "I love this drill because is is very modifiable. You can start simple, with coaches controlling the play, and progress to complex variations which include 2 on 1’s!\nI’ve used this drill with all levels of experience, from beginners up to college-level players, and it’s always a lot of fun!\nCoach Regroup 2 on 0\nForwards in each of the corners, one defenseman on each blueline.\n1. Forward steps out, passes to far D-man.2. Both forwards from that line swing through for a regroup pass.3. After receiving the return pass, forwards regroup with other D-man, then return 2 on 0.\nOPTIONS: start simple with one side at a time, progress to both sides simultaneously, then to a 2 on 1.\nEnjoy!!\nWeiss",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Czech Race",
    "url": "https://weisstechhockey.com/czech-race/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2015/02/czech_race.jpg",
    "video_url": "https://www.youtube.com/embed/Sq4DxCrQ6cA?wmode=transparent",
    "instructions": "This one is a great, full-speed sprint race. Lots of intensity, and good opportunity for some physical contact.\nCzech Race:1. Players line up on red lines2. On the whistle, two players across from each other race to the puck3. The player who gets to the puck first shoots, other player backchecks4. On the next whistle the other two players go the other way",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "D to D Stretch Pass",
    "url": "https://weisstechhockey.com/d-to-d-stretch-pass/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/04/Screenshot-2019-04-24-15.18.41-1024x506.png",
    "video_url": "https://www.youtube.com/embed/O2J59ipdwkY?feature=oembed",
    "instructions": "I don’t get a ton of full-ice practices in my organization. But when I do, I like to take full advantage of the bigger ice, and work on things that can’t be done on a smaller segment of ice.\nStretch passes, Regroups, and full-ice Timing drills are where I spend my time in the rare occasion I get a full-ice practice.\nHere’s a great stretch pass drill to add to your library:\nVARIATION:Have the Defenseman who makes the stretch pass close the gap and play 1 on 1 with opposite Forward\nCLICK HERE FOR FULL PRINTOUT",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Drive Drill Race",
    "url": "https://weisstechhockey.com/hockey-angling-drills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/10/drive_drill_race.jpg",
    "video_url": "https://www.youtube.com/embed/fg_lHIVmRDM?wmode=opaque",
    "instructions": "The Drive Drill Race is a great hockey angling drill that can be used at any age or skill level. Here’s what it looks like:\nDrive Drill Race Explanation:\n1. (F) makes give and go with (P)2. (D) can’t leave until (F) has received the pass3. 1 on 1 to the net",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Give and Go 1 on 1",
    "url": "https://weisstechhockey.com/give-and-go-1-on-1/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/12/givego1v1-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/qyPzM-ZUin8?wmode=transparent",
    "instructions": "This is another drill I picked up from the Scott Fukami drill collections available to DrillDraw owners. These drill collections are phenomenal, and are filled with hundreds of REALLY GOOD, well-drawn drills. I highly recommend getting all three drill sets if you own DrillDraw. Here’s the diagram and explanation:\nGive and Go 1 on 1\n**Drill starts on the whistle. Both ends at the same time.\n1. On the whistle, the (F) makes a pass to the (D).2. Return pass to the (F).3. The (F) carries the puck under the blue line for a 1 on 1 on the opposite side.\nOption:A second (F) joins the play as the first (F) skates under the blue line.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "High-Tempo 2v2 Back Checking Drill for Hockey",
    "url": "https://weisstechhockey.com/master-the-2v2-continuous-backcheck-drill-step-by-step-guide/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2024/08/2v2-Continuous-Backcheck-1024x490.png",
    "video_url": "https://www.youtube.com/embed/GQl4oILv5Q4?feature=oembed",
    "instructions": "Elevate Your Team’s Game with the Two Versus Two Continuous Back Check Drill\nHockey is a fast-paced, high-intensity sport that demands not only skill and speed but also a relentless work ethic, especially when it comes to defensive play. One of the most critical yet often under-practiced aspects of hockey is back checking—the art of hustling back to defend after a turnover or offensive rush. To help coaches and players master this essential skill, Jeremy Weiss of Weiss Tech Hockey introduces a dynamic and engaging drill: the Two Versus Two Continuous Back Check Drill.\nThis drill is designed to simulate real-game scenarios in a confined space, pushing players to their limits while making the learning process enjoyable. Let’s break down the setup, execution, and benefits of this high-tempo drill, and explore how it can transform your team’s approach to back checking and overall defensive play.\nBack checking is the backbone of effective team defense. It’s the effort players put in to recover after losing possession, racing back to disrupt the opposition’s attack. Strong back checking can be the difference between a scoring chance against and a successful defensive stand. It requires speed, awareness, and a commitment to team play.\nMany teams struggle with consistent back checking, especially in youth and amateur hockey. Players may not fully grasp its importance, or they may lack the conditioning to execute it effectively throughout a game. Drills that emphasize back checking in a fun, competitive environment can help bridge this gap.\nThe Two Versus Two Continuous Back Check Drill is a confined-space, high-intensity exercise that combines offensive rushes with immediate defensive transitions. It’s designed to keep players moving at full speed, simulating the quick changes of possession that occur in real games.\nThe drill’s confined space and rapid transitions closely mimic the pace and pressure of actual games. Players learn to make decisions under duress and adapt quickly to changing situations.\nWith constant sprints and minimal rest, players build endurance and explosiveness. This translates directly to better performance in games, especially late in periods when fatigue sets in.\nBy repeatedly transitioning from offense to defense, players develop a stronger sense of responsibility and anticipation. They learn to recognize when to back check and how to position themselves to disrupt the opposition.\nThe two-on-zero rushes give players opportunities to practice quick passes, creative plays, and finishing skills—all under the pressure of back checkers closing in.\nThe drill fosters communication and teamwork, as players must work together on both sides of the puck. It also builds a culture of accountability, where everyone is expected to contribute defensively.\nIf players are coasting on the back check, remind them that the drill’s purpose is to simulate game-speed transitions. Consider adding incentives or consequences to encourage maximum effort.\nEnsure players know when to switch from offense to defense. Use clear signals (whistle, verbal cue) and reinforce the timing during walkthroughs.\nThe drill is demanding. Monitor players for signs of excessive fatigue and adjust rest periods as needed. Rotate groups to keep everyone fresh and engaged.\nFor older or more advanced teams, consider making it a three-on-two or three-on-three drill. This increases complexity and further challenges players’ decision-making and communication.\nModify the drill to simulate power play or penalty kill situations, giving players experience in different game scenarios.\nKeep track of goals, successful back checks, or turnovers to add a statistical element. This can motivate players and provide measurable benchmarks for improvement.\nOne of the standout features of the Two Versus Two Continuous Back Check Drill is its ability to blend hard work with enjoyment. Players are pushed to their limits, but the competitive, fast-paced nature of the drill keeps them engaged and motivated. When players are having fun, they’re more likely to give maximum effort and retain what they learn.\nFor those looking to implement this drill and others like it, Weiss Tech Hockey offers a wealth of resources:\nVisitWeiss Tech Hockeyfor more information and to access these valuable tools.\nThe Two Versus Two Continuous Back Check Drill is a powerful addition to any coach’s toolkit. By emphasizing high-tempo transitions, defensive responsibility, and offensive creativity, it prepares players for the demands of real-game situations. Its confined space and continuous flow ensure that every participant is engaged, challenged, and improving with each repetition.\nWhether you’re coaching youth hockey or working with advanced players, this drill can help instill the habits and skills necessary for success. Make it a regular part of your practice routine, and watch your team’s back checking—and overall game—reach new heights.\nCLICK HERE TO PURCHASE (use code JWEISS15 for 15% off at checkout) >>\nJeremy Weiss (with his translator) presenting at a hockey coaching symposium for the Russian Federation in Moscow—2018.\nHockey coach and international consultant, Jeremy Weiss, has worked with thousands of coaches worldwide since 2008 to help produce championship teams at every age and skill level.\nHe is known internationally through the work he has done online. In 2008 he invented “digital chalktalks” which combined screen sharing with drill diagramming software, to produce a training experience nobody had ever seen before. His YouTube following quickly grew to over 19,000 subscribers, and he has produced over 130 training videos.\nJeremy runs a development blog for coaches, which has over 280 posts. He is the author of 10 hockey books for coaches, and is the editor of Hockey Development Magazine.\nHe was trained in the Eastern European style as a pre-teen, by his Czechoslovakian skills coach, and competed internationally as a “Wexford Raider” among the top youth hockey programs in the world including Russia, Czechoslovakia, Finland, and top teams in his home province Ontario, Canada.\nHe majored in Exercise Sciences at Brigham Young University, and subsequently worked as a Personal Trainer, where he continued to study and develop ideal training methods for hockey.\nHe has incorporated the very best pieces from the various training styles he has been involved in, and has built a world-class off-ice strength and conditioning program that fits the specific needs of hockey players.",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "MacDonald Forecheck Drill",
    "url": "https://weisstechhockey.com/macdonald-forecheck-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/macdonald_forecheck_pt2.jpg",
    "video_url": "https://www.youtube.com/embed/32TzRzxU3wI?wmode=transparent",
    "instructions": "The MacDonald Forecheck is a nice little drill to work on forechecking lanes and angles. Here’s the diagram and explanation:\nMacDonald Forecheck Drill\n1. On whistle, forecheckers take a lap around the center circle2. As the forecheckers finish their lap, coach dumps the puck in3. Forecheckers attack, 5-man unit breaks out4. After the breakout occurs, puck is passed back to the coach5. 2 of the 3 forwards peel out to take a lap around the middle circle, becoming the new forecheckers (forwards must communicate who goes!)6. As forecheckers finish the turn, coach dumps the puck in for a breakout from the far end7. New 5-man unit moves into the end that just broke out\nEnjoy!\nJeremy",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Man in the Box Drill",
    "url": "https://weisstechhockey.com/1on1hockeydrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/mib-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/COOwEfcXZ3o?wmode=transparent",
    "instructions": "This is another one of my favorite 1 on 1 hockey drills. The set-up is very simple, but there are SO MANY important concepts that can be worked on… it is VERY effective!\nDon’t let your defensemen complain that the drill isn’t fair––by the end of the season, EVERY defenseman should be able to keep up with the forwards. They’ll have to do this in the games… might as well work on it in practice!!\nYou can also do this same drill with a 2 on 1, just start two lines from the corner. Same rules still apply. Here’s the diagram:\nMan in the Box\n1. (F) starts in corner with puck – one skate behind the line!2. (D) starts in faceoff circle with stick in the dot (as speed improves, move (D) closer and closer)3. on whistle, forward and defenseman race to the red line, staying on their own respective sides of the cone4. the forward can’t cut inside and the defenseman can’t begin to angle until AFTER they’ve passed the cone5. After the cone they can play a 1 on 1\nENJOY!!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Michigan Tech 1 on 1 Drill",
    "url": "https://weisstechhockey.com/michigan-tech-1-on-1-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/10/michigantech-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Y8C3UiWMnsg?wmode=transparent",
    "instructions": "This is one of my favorite 1 on 1 drills because you can use it to work on so many different skills. Make sure your forwards swing fairly deep into the zone to receive the breakout pass. This will allow the opposing defenseman time to close the gap properly and play the 1 on 1 the way he or she should in a game.\nAlso, make sure your defensemen get outside the blue line… that gap MUST be closed, and the defensemen need to be able to get their speed up quickly after the pivot. Here’s the diagram:\nMichigan Tech 1 on 1\n1. On whistle, 2 forwards and 2 defensemen leave\n2. Defensemen do a figure 8 around the cones, then make a breakout pass to the forward swinging through from the far end\n3. After making the pass, defensemen close the gap on the forward who left from their same side\n4. If coach blows the whistle twice, the forwards change direction and play the 1 on 1 with the other defensemen\n5. Coach can blow the whistle multiple times during the same turn. Defensemen must continue to close the gap with each switch.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "On the Dot 3 on 2",
    "url": "https://weisstechhockey.com/on-the-dot-3-on-2/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/12/onthedot-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/hCSx2IaDQlw?wmode=transparent",
    "instructions": "This can be a fantastic drill, depending on the skill level of your players. At best it’s a quick-paced, high-intensity, odd-man-rush drill. At worst it can be quite slow, with too much standing around… So, as I’ve often said, USE YOUR “INFINITE WISDOM” AS COACH to determine whether this drill will be a good fit for your team 🙂\nOn the Dot 3 on 2\n2 on 2 plus 1. Players on dots can pass or shoot, but can’t leave the dots.\nMake it 3 on 3 plus 1 after a while\nUPDATE: I suggest letting the “dot men” move anywhere within their half, so it becomes a true 3 on 2 in each zone (notice added cones)\nEnjoy!!\nWeiss",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Pressure v. Contain 1 on 1",
    "url": "https://weisstechhockey.com/pressure-v-contain-1-on-1/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2015/03/pressure-v-contain-1-on-1.jpg",
    "video_url": "https://www.youtube.com/embed/gWeFTxnA5jM?wmode=transparent",
    "instructions": "Good drill from thePIJE drill collectionover at DrillDraw\nPressure v. Contain 1 on 1:1. Form groups of two around the rink.2. In each group, there is one forward (carrier) and one defense (forechecker).3. The forechecker tries to prevent the carrier to move toward the center: A) the forward does not have control of the puck (pressure situation), then, B) the carrier has full control of the puck (contain situation).4. Reverse the roles for each sequence.",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Slovakian 3-Pass and Shot Drill",
    "url": "https://weisstechhockey.com/slovakian-3-pass-and-shot-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/05/slovakian_hockey_drills.jpg",
    "video_url": "https://www.youtube.com/embed/0d7tFxS6PTI?wmode=transparent",
    "instructions": "Here’s a solid drill from my Slovakian friend Jan Bednar. He sends me awesome drills from time to time, and they’re always exactly my style! This drill has two variations, one ends in a 1 on 0, and the other ends in a 1 on 1. Here’s the diagram:\nSlovakian 3-Pass and Shot Drill:\n1. Player from low line passes to the first player from the line at center ice.2. One-touch pass back, then loops around the center circle.3. Player from low line receives pass, then executes side-step crossovers to the far side of the circle, powerturns out of the crossovers, and hits the other player with a long pass.\nVariation:Same set-up as above, except play ends in a 1 on 1 (see diagram #2)\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Stop & Start Angling",
    "url": "https://weisstechhockey.com/stop-start-angling/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2015/05/stop-and-start-angling.jpg",
    "video_url": "https://www.youtube.com/embed/WFdq_7bwxCk?wmode=transparent",
    "instructions": "I used this drill last week with a group of Mites and Squirts in a local clinic here in Salt Lake City. It was a progression from some of the skills we had been working on earlier in the session. This drill combines stops and starts, angling, and drive skating.\nStop & Start Angling:1. Players line up as shown, offensive player (white) in the corner, defensive player (blue) toward the middle, players waiting in line near the blue line.2. Offensive and defensive players start facing each other. Each stop and start is to be done facing each other.3. On the whistle, players run a mini ladder: out to the first cone and back, then out to the second cone and back.4. After the ladder, both players skate out around their respective cones, the offensive player tries to drive deep below the first cone, the cut to the net. Defensive player angles.5. Stagger the starts of each side, so the goalie doesn’t face two shots at the same time.",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Teaching Defense to 7-Year-Olds",
    "url": "https://weisstechhockey.com/teaching-defense-to-7-year-olds/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2016/12/angling-1024x576.png",
    "video_url": "https://www.youtube.com/embed/MjPcTCDTUQg?wmode=transparent",
    "instructions": "I recently received an email asking about 1 on 1 strategy for 7-year-old defensemen. The coach asked whether he should be teaching the players to play it skating backward (even though they don’t skate well backward yet), or starting forward then pivoting backward, or something else altogether.\nI thought it was a great topic for discussion, and one I’m currently dealing with as well, since I’m working with the same age group on my son’s team. So… as I always say, here’s my two cents worth:\nMost 7-year-olds aren’t capable of skating backwards well enough to play a proper 1 on 1. But there are still 1 on 1s in games. So what do you do? Here’s my strategy:\nSIDE NOTE:As your lesser-experienced players begin improve, let them play some defense too. Start them as two-man units, angling. Eventually progress them to play the conventional 1 on 1.",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Tom Renney Warm-up",
    "url": "https://weisstechhockey.com/tom-renney-warm-up/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/renney-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/9JcG88vK4ko?wmode=transparent",
    "instructions": "This is a fantastic warm-up drill for more advanced teams. My old junior coach back in Toronto, Kevin Burkett, used to run this with us almost every practice. It’s great because it is high speed, mimics many different game situations, and involves every player on the ice. Here’s your diagram:\nTom Renney Warm-Up\nBoth sides go at the same time. After the dump in and breakout, both defensemen play 2 on 1 against the other line’s forwards.\n1. two forwards swing low and receive a pass from the coach, then step over the center line and dump it in.2. goalie stops the puck for the defenseman, who initiates the breakout, then plays 2 on 1 against forwards from the other line.3. forwards attack 2 on 1 against the defenseman from the other line\nNote: You can start the forwards and defensemen on the same side (as shown in the video), and make sure your players keep their heads up. Or stagger the corners (as shown in the diagram), to avoid congestion in the middle.\nEnjoy!",
    "teaching_points": "",
    "category": "1 on 1's, 2 on 2's, 2 on 1's, 3 on 2's",
    "source": "weisstechhockey"
  },
  {
    "title": "Advanced Hockey Breakout Progression",
    "url": "https://weisstechhockey.com/advanced-hockey-breakout-progression/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/01/advancedbreakout-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/KpivKwZ31lM?wmode=transparent",
    "instructions": "This is a highly effective breakout progression. There are endless ways to change it up to work on different game situations, and it involves many recurring passing patterns. Since there are many possible “points of failure” I only recommend this drill for older, or more advanced hockey teams. Here’s the diagram and explanation:\nAdvanced Hockey Breakout Progression\n1. D to D to Wing2. D to D to Wing3. D to D to Wing, one-touch to Center4. D to D to Wing, one-touch to D who follows up play5. Start again from the other side\nOPTIONAL: Put defensemen on far blue line for a 1 on 1.\nEnjoy!!",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Breakout, Regroup, Regroup, Attack Drill",
    "url": "https://weisstechhockey.com/breakout-regroup-regroup-attack-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/breakout-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/AYEbG0K4eN0?wmode=transparent",
    "instructions": "Since finishing up ourCoaches’ Training Course, a few people have asked about different ways of practicing some of the systems we discussed in the course. This drill is in response to the questions about practicing breakouts and regroups.\nThe “Breakout, Regroup, Regroup, Attack Drill” is extremely versatile, and can be used to work on a number of different game situations. After your team gets good at it, try throwing in a forechecker (or two). You can designate where and how you want the forechecking pressure coming in, which will make your defensemen have to read and react to different scenarios.\nFor a more detailed explanation of the Swing Regroup mentioned in this video,CLICK HERE\nHere’s the diagram and explanation:\nBreakout, Regroup, Regroup, Attack\n1. Coach dumps puck into one end, forwards execute a breakout2. After breakout, forwards perform a regroup with the far defensemen, then regroup with the first set of defensemen (same ones they broke out with)3. After second regroup, forwards and defensemen attack 3 on 2\nEnjoy!",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Controlled Skating Breakout Drill",
    "url": "https://weisstechhockey.com/controlled-skating-breakout-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/controlled_skating_breakout.jpg",
    "video_url": "https://www.youtube.com/embed/T6h4Dg2hohw?wmode=transparent",
    "instructions": "Although this drill loosely mimics a breakout drill, the real purpose behind this one is to introduce Timing and Support concepts to youngsters. Players must time their skating to arrive at the designated receiving zones on time for a possible pass. Here’s the diagram:\nControlled Skating Breakout Drill\n1. 2 lines of Fs and Ds on the blue lines (out of the way)2. D starts drill on dot3. On the whistle, F passes to D, who pivots toward the boards, then skates behind the net to initiate a breakout4. F control skates through each of the 4 receiving zones, presenting him or herself as a passing option in each zone (never taking eye off puck)5. After receiving pass, F attacks 1 on 0\nOption: Add D to the far blue lines for a 1 on 1\nEnjoy!",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Fukami Breakout Warm-up Drill",
    "url": "https://weisstechhockey.com/fukami-breakout-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/fukami_breakout_warm-up.jpg",
    "video_url": "https://www.youtube.com/embed/zWs_NtH0h7c?wmode=transparent",
    "instructions": "The Fukami Breakout Warm-up Drill is a great drill to get everybody moving. It incorporates a little bit of everything, and even involves the goalies in the play. Here’s the diagram:\nFukami Breakout Warm-up\n1. On the whistle, forward dumps a puck on net2. Goalie sets the the puck up for the defenseman, who has skated back to retrieve it3. Forward times his/her skating, and explodes through the middle to receive a pass from the defenseman, then shoots\nVariation: The forward can delay in the corner, then make a pass to the defenseman for a shot on net. (Not shown)\nEnjoy!",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Hockey Breakout Drill",
    "url": "https://weisstechhockey.com/hockey-breakout-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/breakout-1-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/2R0dVcT3hZ8?wmode=transparent",
    "instructions": "Many hockey situations occur in patterns. This simplehockey breakout drillbreaks down these patterns into their simplest form, then puts them back together in sequence to mimic a game situation. Here’s the diagram and explanation:\nPHASE 1:1.Set up forwards on the blue line, with defensemen on the close hash mark. Defenseman who is going steps out to the dot2.On whistle, ﬁrst forward in line passes to the defenseman, then skates down around the bottom of the circle and opens up for a breakout pass3.Defenseman skates behind the net, then passes to the forward on the boards, who skates down for a shot\nNote: Teach forwards to pivot and keep their eyes on the passer while receiving the pass\nPHASE 2:1.Same set-up as phase 12.On whistle, ﬁrst forward passes to the defenseman, then skates the same route as in phase one3.Second forward in line plays the role of the centerman, and “shadows” the defenseman, who is skating the puck behind the net4.Pass is made to the board-side forward, then a touch pass to the second forward, who is swinging through for support5.Forwards attack 2 on 0\nNote: As players improve, open up the option for a middle breakout to the second forward\nPHASE 3:1.Same set-up as phases 1 and 22.Drill begins the same as in phases 1 and 2, this time we add the third forward as a breakaway man3.The third forward times the play so he is breaking through the middle for a pass as the second forward receives the pass and gains control of the puck4.Players attack 3 on 0 using the attack triangle\nNote: Be creative with this set-up. Try adding a second defenseman for a D to D pass in stead of skating it behind the net. Open up multiple breakout options.\nPHASE 4:1.Same set-up as phases 1, 2, and 3, except now it ends in a 3 on 1, or a 3 on 2\nNote: Remind forwards to keep their heads up in the neutral zone. Work with your defensemen on judging when and when not to step up and intercept the stretch pass\nEnjoy!",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Perpetual Breakout Drill",
    "url": "https://weisstechhockey.com/perpetual-breakout-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/11/perpetual-breakout-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/zEKifoppEnM?wmode=opaque",
    "instructions": "The Perpetual Breakout is a great drill to develop hockey breakout abilities in a high-tempo, flow and timing setting. Here’s what the drill looks like:\nPerpetual Breakout Explanation:\n1. “Ghost man” passers start the drill by shooting then picking up a puck behind the net to initiate the breakout2. Low forward simulates winger, and swings in to pick up board-side breakout pass3. High forward swings through and acts as the centerman providing middle support4. winger one-touches to center, who attacks and shoots, then initiates breakout in far zone5. winger moves to middle line.\nNOTE: winger can swing from top down, or from bottom up, depending on your team’s breakout set up.",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Perpetual Forecheck",
    "url": "https://weisstechhockey.com/hockey-forechecking-drills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/09/hockey_forechecking_drills-1024x615.jpg",
    "video_url": "https://www.youtube.com/embed/MZ30CupL_LI?wmode=opaque",
    "instructions": "I’ve been using this Hockey Forechecking Drill in my practices, and it has worked really well for my team. The thing I really like about it, is that it allows you to work on a lot of different stuff at once. Obviously, the main focus is forechecking, but you’re also working on D-Zone Coverage, and Breakouts as well.\nHere’s how the drill works:\nGive this one a go – I think you’ll get some good usage out of it!",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "Weiss Tech Hockey's Top 5 Most Popular Posts of All Time",
    "url": "https://weisstechhockey.com/weiss-tech-hockeys-top-5-most-popular-posts-of-all-time/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/12/IMG_2843.jpg",
    "video_url": "",
    "instructions": "I started this blog a little over 4 years ago… which is a long time in internet years! It started as a bit of an experiment for me. I wanted to try and use web technology to help local coaches with their practice plans. I’d been playing around with a “new” drill diagrammer I had just come across, DrillDraw, and thought it would be cool to make video explanations of drills using a “digital whiteboard.”\nI started by posting a few video explanations of my favorite drills, and things just kinda took off from there! At that time, nobody was doing digital video explanations, and it seemed to be a method of delivery that resonated with coaches.  As things have progressed, we’ve branched out into other aspects of hockey training and development, and the blog has developed into the format you see today.\nThis week I was doing a bit of reflection, and I got curious as to which of my posts have been the most popular (in terms of page views) over the past 4 years. So I decided to look into it, and post Weiss Tech Hockey’s Top 5 Most Popular Posts. Here they are (remember, my video-production abilities have evolved over the years… so you might get a good laugh at some of my older stuff!):\nWeiss Tech Hockey’s Top 5 Most Popular Posts of All Time\n5. Breakouts: Color-coded Breakout System4. Breakout Progression Drill3. Forecheck: 1-2-2 “Foosball” Forecheck2. My Favorite Off-Ice Agility Drill\nAnd the Number 1 Weiss Tech Hockey Post of All Time…\n1. 9 Half-Ice Hockey Drills Every Coach Should Know\nHELP US OUT!So there’s the Top 5. I’d love to know which Weiss Tech content has been the most useful for you. Leave your comments in the section below, and let us know what has been useful, and what you’d like to see more of.\nThanks for your participation!\nJeremy",
    "teaching_points": "",
    "category": "Breakouts",
    "source": "weisstechhockey"
  },
  {
    "title": "1 on 1 Big Arc Backchecking",
    "url": "https://weisstechhockey.com/1-on-1-big-arc-backchecking/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/03/Screenshot-2019-03-14-11.30.22-1024x495.png",
    "video_url": "https://www.youtube.com/embed/jL5r5bGdL7E?feature=oembed",
    "instructions": "This is a simple drill, with a simple setup, that can be used to address a lot of different pieces of the game, including Lane Control, Body Positioning, and One Timer Shots on both Proper and Off Wings.\nVariation: Send two offensive and two defensive players together\nCLICK HERE FOR FULL PRINTOUT",
    "teaching_points": "",
    "category": "Checking & Angling",
    "source": "weisstechhockey"
  },
  {
    "title": "9 Half-Ice Hockey Drills Every Coach Should Know About",
    "url": "https://weisstechhockey.com/halficehockeydrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/quadpass-1-1024x559.jpg",
    "video_url": "",
    "instructions": "With the cost of ice time going up, many teams are sharing practice sessions, especially at the younger age groups. The need for half ice hockey drills continues to grow, and has been a highly requested topic from our readers. So, instead of just doing a video or two, I put together 9 of my favorite half ice hockey drills spanning across all levels of play… beginner to advanced. I’ve also included a printable PDF version as well as the Importable DrillDraw files, if you want to bring all this stuff to the rink with you. You’ll find the links at the bottom of this page.\nHere we go!!\nThere you have it! Hopefully these come in handy for you.\nEnjoy!",
    "teaching_points": "",
    "category": "Checking & Angling",
    "source": "weisstechhockey"
  },
  {
    "title": "Figure 8 Angling Drill",
    "url": "https://weisstechhockey.com/hockeybodycheckingdrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/figure8angling2-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/XwFSX1MGZzs?wmode=transparent",
    "instructions": "Remember, as you progress into hockey body checking drills, to stress that the purpose of body checking in hockey is to separate the man from the puck. To do this effectively, players need a strong base in the following areas:\nHere’s the explanation:\n1. Players start facing each other on dot2. (F) picks up a puck and drives wide3. (D) skates around cones as shown, then angles4. (F) has to drive around lower cone before cutting to the net\nVariations: (a) take out the cone at hashmarks (b) allow forward to cut inside earlier\nCheers!",
    "teaching_points": "",
    "category": "Checking & Angling",
    "source": "weisstechhockey"
  },
  {
    "title": "Penalty Kill Forecheck Angling Drill",
    "url": "https://weisstechhockey.com/penalty-kill-forecheck-angling-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/pk_forecheck_angling.jpg",
    "video_url": "https://www.youtube.com/embed/qohjfiZtDY0?wmode=transparent",
    "instructions": "The Penalty Kill Forecheck Angling Drill works really well to teach proper angling technique for F1 & F2 on the PK forecheck. Here’s the diagram and explanation:\nPenalty Kill Forecheck Angling Drill\n1. Breakout man skates in, and opens up to either side for a breakout pass from the coach2. F1 and F2 angle to take away the skating lane and passing lanes, respectively3. If F1 and F2 fail to eliminate the breakout, the breakout man passes to the NZ coach for a give and go, and a shot on net\nNote: This drill can be run as a 2/3 ice drill by eliminating the option for a shot on goal. Play would end with the pass back to the NZ coach\nEnjoy!",
    "teaching_points": "",
    "category": "Checking & Angling",
    "source": "weisstechhockey"
  },
  {
    "title": "5-Card Skating Drill",
    "url": "https://weisstechhockey.com/5-card-skating-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/5-card_skating_drill.jpg",
    "video_url": "https://www.youtube.com/embed/L-Pzw_50gDk?wmode=transparent",
    "instructions": "5-Card Skating is a great drill my assistant coach, Ryan Newton, came up with. I like this one because it lets you work on the defensive zone coverage skating patterns while getting some conditioning in. Here’s the diagram:\n5-Card Skating Drill\n1. Players start in 5-card formation2. On whistle, each position skates full speed out to his or her designated attack area, pivots, then skates backward into 5-card position3. Sequence follows, position by position. Center covers for the corner positions until they get back, and takes the seam (attack areas 2 and 5)4. Wingers alternate between attack positions each “lap”5. Do 4 “laps” then switch out 5-man unit for a new one\nEnjoy!",
    "teaching_points": "",
    "category": "Conditioning",
    "source": "weisstechhockey"
  },
  {
    "title": "Half-Ice Bednár Conditioning Drill",
    "url": "https://weisstechhockey.com/half-ice-bednar-conditioning-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/11/half-ice-bednar-conditioning.jpg",
    "video_url": "https://www.youtube.com/embed/KadoUsomwYc?wmode=transparent",
    "instructions": "From time to time our coaches send me drills, this is a great half-ice conditioning drill from Ján Bednár out in Slovakia.  Here’s the diagram and explanation:\nHalf-Ice Bednár Conditioning Drill\nNOTE: make sure players are alternating lines so they develop stops and starts in both directions.",
    "teaching_points": "",
    "category": "Conditioning",
    "source": "weisstechhockey"
  },
  {
    "title": "Michigan Mile - Hockey Conditioning Drill",
    "url": "https://weisstechhockey.com/michigan-mile-hockey-conditioning-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/12/michigan_mile.jpg",
    "video_url": "https://www.youtube.com/embed/ny1yU2wTusM?wmode=transparent",
    "instructions": "The Michigan Mile is one of my favorite Hockey Conditioning Drills. I picked it up from my old assistant coach, Josh Burkart, who grew up in Michigan. I love it because it’s short, explosive bursts of speed, and can be done in a variety of ways. It also offers an optimal 3:1 rest-to-work ratio, which is perfect for hockey players. Here’s the diagram and explanation:\nMichigan Mile:Four groups, on blues, facing each other. As soon as group 1 finishes, group 2 goes. Then 3, then 4, then back to 1.\n1. red line and back – 5 push-ups2. far blue line and back – 5 push-ups3. red, back, far blue, back – 5 push-ups4. far blue, red, far blue, back – 5 push-ups5. red, back, far blue, back – 5 push-ups6. far blue line and back – 5 push-ups7. red line and back – 5 push-ups\nVariations: Sit-ups instead of push-ups; down on knees at each stop; add pucks; etc.",
    "teaching_points": "",
    "category": "Conditioning",
    "source": "weisstechhockey"
  },
  {
    "title": "Perpetual Backcheck Drill",
    "url": "https://weisstechhockey.com/hockeybackcheckingdrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/perpbackcheck-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Xmr7oxUUze0?wmode=transparent",
    "instructions": "The Perpetual Backcheck Drill is a great competition drill to keep players motivated and having fun while working on their conditioning. I use this one quite often with my own teams. Here’s the diagram:\nPerpetual Backcheck Drill1. First player in each line leaves and receives a pass from the coach.2. Each player skates full speed down the ice and takes a shot.3. Next player in line can’t leave until the shot has been taken.4. After the shot, the shooter will peel off and backcheck the next player in line.5. Drill continues perpetually.\nEnjoy!",
    "teaching_points": "",
    "category": "Conditioning",
    "source": "weisstechhockey"
  },
  {
    "title": "Face-off Sequence",
    "url": "https://weisstechhockey.com/face-off-sequence/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/08/faceoff_sequence.jpg",
    "video_url": "https://www.youtube.com/embed/grRwGwkfbgs?wmode=transparent",
    "instructions": "This Face-Off Sequence is a great way to nail down your face-off set-ups, no matter which zone you’re in. Here’s the diagram and explanation:\nFace-Off Sequence\nRun this drill to work on any type of face-off\n1. Run a set face-off play with no defenders2. Run a set face-off play with defenders’ sticks turned upside down3. Run a set face-off play with defenders’ sticks turned the right way. 5 on 5 controlled scrimmage.\nEnjoy!",
    "teaching_points": "",
    "category": "Face-Offs",
    "source": "weisstechhockey"
  },
  {
    "title": "6 Puck Shootout",
    "url": "https://weisstechhockey.com/6-puck-shootout/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2017/01/6puckshootout-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/ec4VqwrU9ZQ?wmode=transparent",
    "instructions": "The 6 Puck Shootout is a fun drill that works on breakaways. Since it’s a race, players run through at full speed, and have more pressure than in typical shootout drills. I love slotting this one in at the end of practice!\n6 Puck Shootout:1. Players set up as shown, half in each bench. Goalie in each net. 6 pucks on each blue line.2. On the whistle, the first player on each team takes a breakaway.3. If the player scores, he or she has to race over and touch the boards before the next player can go.4. If the player misses, he or she must get his or her own rebound and pass it pack to the next player in line.5. First team to score all 6 pucks wins. Losing team (including goalie) does push-ups.6. Switch goalies and play again.",
    "teaching_points": "",
    "category": "Fun",
    "source": "weisstechhockey"
  },
  {
    "title": "Musical Pucks",
    "url": "https://weisstechhockey.com/musical-pucks/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/02/musicalpucks-1024x559.jpg",
    "video_url": "",
    "instructions": "Working on crossovers can be hard and frustrating for many young hockey players. I’ve found that turning skill development drills into shooting drills or games can make them a lot more fun and motivating to work on. Musical Pucks is a small area game that demonstrates this tactic well. Here’s the diagram and explanation:\nMusical Pucks\n1. Put one less puck in the middle than you have players on circle2. Players cross over until whistle3. On whistle, each player tries to get a puck – whoever doesn’t get one is out4. Make sure to run it both directions so players practice crossing over both ways.\nEnjoy!!",
    "teaching_points": "",
    "category": "Fun",
    "source": "weisstechhockey"
  },
  {
    "title": "QuickStickz Review",
    "url": "https://weisstechhockey.com/quickstickz-review/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/12/qs_drills-Copy-1024x983.png",
    "video_url": "https://www.youtube.com/embed/RLOEG5UfNvg?wmode=opaque",
    "instructions": "I’ve been really excited to get this post out, and let you know about a cool product calledQuickStickz. QuickStickz is an innovative new way to work on your stickhandling abilities off the ice, and it’s a lot of fun too!\nA few months ago I was invited to take a look at QuickStickz, which is a video-game-based, hockey stickhandling development system. I had seen the product before, but I’d never had the chance to get my hands on one. The idea seemed really cool, so I was excited to see what it was all about.\nHow it Works:QuickStickz uses a special infrared camera that connects up to your PC via USB jack. The camera combos up with a customized SmartHockey stickhandling ball, that has been machined out with a whole bunch of tiny reflectors all over its surface. As you stickhandle, the camera picks up the movements of the ball, and sends the signal into the computer, which allows you to see your stickhandling movements on the screen.\nSet-up is pretty simple, just plug in the camera, go to the QuickStickz member’s area, and install the plug-in when prompted.\nDrills and Games:Once you’re up and running, just select a drill or a game from the member’s area, and have at it! The drills are designed to help you work on various skills such as tight puck movement, wide puck movement, dekes, toe drags, etc. The games apply these skills in a more dynamic environment.\nMember’s Area:The member’s area is a great way to track your progress. You can check your own stats and progress, or see how your top score compares to other top scores from around the world. The member’s area also tracks how much time you’re spending on QuickStickz. This makes it easy for parents or coaches to check in on the player’s efforts and progress.\nConclusion:QuickStickzis a great tool to help any player develop his or her stickhandling abilities. It’s a lot of fun, and it’s a product that I think connects with kids on their level. The one weakness of QuickSticks is that it’s fairly sensitive to the ambient lighting in the room you’re using it in. Sunlight badly interferes with the infrared signal put out by the camera, and makes the ball just jump around on the screen. So make sure you close the blinds, and rely on your “artificial lighting” (regular lightbulbs), and you should be just fine!",
    "teaching_points": "",
    "category": "Fun",
    "source": "weisstechhockey"
  },
  {
    "title": "11 Visual Targets for Hockey Goalies",
    "url": "https://weisstechhockey.com/11-visual-targets-for-hockey-goalies/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/01/visualtargets.jpg",
    "video_url": "https://www.youtube.com/embed/R-vv-oTV_9c?wmode=transparent",
    "instructions": "Angles are, arguably, the most important part of a goaltender’s game.  If you cannot manage your angles appropriately, it will be more difficult to make the simple saves. Using these 11 visual cues on the ice will assist goaltenders, at all levels, to manage where they are on the ice.\n11 Visual Cues: Sequence 11 & 11 – Goal Line2 & 10 – Board-side Hashmarks3 & 9 – Defensive Zone Dots4 & 8 – Blue Line on the Boards4 & 7 – Neutral Zone Dots6 – Straight up the Middle\n11 Visual Cues: Sequence 21. Spray paint lines on the ice that match up with the visual cues2. Set up pucks further out along the visual cues (spray paint dots to keep the set-up)3. Players shoot from the spray painted dots, goalie uses spray painted lines to judge angles\nNotes:In this drill I discuss marking the ice using rope and paint.  This is not absolutely necessary to work with the visual cues but will help a younger goalie correct his or her position within a practice.  After doing this once or twice, you shouldn’t have to do it anymore unless the goaltender continues struggling with angles.\nAnother good idea is to take video of the goalies telescoping in and out.  You can then show them the video so they can see how the angles change while they move in and out at the cue.  This will definitively teach them how angles work.   All of this seems very simple and basic, yet almost all goalies struggle (even some of the most experienced) with angles at some time in their career.  Work on this and you will definitely be a better goalie.\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "3 Cone Rebound Drill",
    "url": "https://weisstechhockey.com/3-cone-rebound-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/3conerebound.jpg",
    "video_url": "https://www.youtube.com/embed/tjBHqkUQjhc?wmode=transparent",
    "instructions": "The 3 Cone Rebound Drill will work on stopping the puck from outside shots, rebound control, recovering, covering the puck, handling rebounds and more. Here are the goalie’s objectives:\n1. Stop the Puck!2. Rebound Control3. Proper Recovery\nHere’s the diagram:\n3 Cone Rebound Drill1. Players line up in corners with pucks2. 3 players leave at the same time from the same line3. Player 1 skates puck around near cone, shoots from above the circles, and stays at the net for the rebound on the next shot4. Goalie tracks, squares up, and fields shot5. Player 2 skates puck around the middle cone, shoots from above the circles, and stays at the net for the rebound on the next shot6. Goalie tracks, squares up, and fields shot – controlling the rebound!7. Player 3 skates puck around the far cone, shoots from above the circles, then drives for his or her own rebound8. Goalie tracks, squares up, and fields shot – controlling the rebound!\nVariation1. Same set up2. 1st player does the same thing3. 2nd and 3rd players do a give and go in the slot with the player who went before them.\nThe second variation forces the goaltender to move much more before the shot is taken. Coaches need to make sure to spread out your shooters so your goaltender can work on his/her objectives in the drill effectively.\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "3 Shooter, Rebound and Recovery",
    "url": "https://weisstechhockey.com/3-shooter-rebound-and-recovery/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/02/recovery.jpg",
    "video_url": "https://www.youtube.com/embed/6kdDpGihqhY?wmode=transparent",
    "instructions": "This is a great, simple, goalie drill. It allows your shooters to work on their shots while the goalie works on his/her movement around the crease, angles and rebound recovery. Here’s the diagram and explanation:\n3 Shooter, Rebound and Recovery Drill:1. Goalie in the net, three shooters set up as shown2. Shooter 1 shoots low glove side. Goalie tries to kick rebound into the corner, then FOLLOWS his rebound and squares up to Shooter 23. Shooter 2 shoots anywhere. Goalie makes the save and stays square to the rebound, wherever it goes.4. Goalie Squares back up to Shooter 1, and this time Shooter 1 shoots low stick side5. Goalie tries to kick rebound into the other corner, then squares up to Shooter 3.6. Shooter 3 shoots anywhere. Goalie makes the save, then squares up to the rebound.7. Drill repeats, with Shooter 1 alternating which side he shoots to.\nVARIATIONS:1. Move the shooters closer or farther away2. Activate shooters 2 and 3 to play the rebounds if applicable3. Add a 4th player that passes the puck from the corner to the shooters\nEnjoy!",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "BIG ANNOUNCEMENT: Goalie Drills at Weiss Tech Hockey!!",
    "url": "https://weisstechhockey.com/big-announcement-goalie-drills-at-weiss-tech-hockey/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/10/circlewarmup.jpg",
    "video_url": "https://www.youtube.com/embed/YcFpn01Gc1w?wmode=transparent",
    "instructions": "I’ll be honest with you… I don’t have a clue when it comes to training goalies! I can tell them a few basic things that are going wrong, or what openings I’m seeing as a shooter, but I generally have no idea how to get them to FIX it. This has been a bit of a dilemma for me on the blog… seeing as how many of you have requested I make a section on GOALIE DRILLS over the past couple of years.\nWell… the waiting is over! I would like to introduce you to Mr. Dennis Hands. Dennis is a great hockey guy, who has the same passion for the game as I do, but with some fabulous expertise in the goalie department. Over the past 5 years, Dennis has had the opportunity to learn from a number of NHL-caliber coaches such as Mike Babcock, Craig Johnson, and Predators’ goalie coach Mitch Korn. Needless to say, he brings a welcomed element of goalie knowledge to the table!\nHere’s a brief bio on Dennis, taken from a recent press release about the High School team he coaches:\nDennis brings over 30 years of hockey experience to the team, including 2 years starting goaltender for Jackson Lumen Christi Catholic High School where he led the team to the State quarterfinals and ended his high school career earning 1st team All-State and being invited and playing in the Michigan High School All-Class All Star game. He had a brief stint in the North American Junior Hockey League before moving on to play Division 1 College Club Hockey. Dennis spent 1 year at University of Michigan-Dearborn and 3 years at University of Arizona playing where he was the starting goalie all 2 1/2 years. During his career at U of A he led the team to a 77-19-1 record as well as 3 appearances in the ACHA National Tournament. Dennis won 2 top Goaltender awards during his career at U of A and in 2004 was inducted in the University of Arizona Icecats Hall of Fame.\nDennis has spent the last five years in volunteer coaching rolls within the Jr. Ducks program. He has a certificate in Hockey team management and scouting through the well known Sports Management Worldwide and is a Level III certified coach through USA Hockey.\nDennis has had a successful 12 year business career including roles as software implementation consultant, software sales manager, V.P. of Software Sales and most recently CEO of a Software Sales and Consulting organization. Dennis holds a bachelor’s degree in accounting and currently resides in Southern California with his wife Kristen and two children, Capriana and Carter.\nLastly, here’s a sample of Dennis’ work (great stuff here!):\nHere’s the explanation and diagram:\nCircle Warm-Up\n1. Goalie faces forward the entire drill (in this example, he/she is facing the 3)2. Starting at 1, goalie performs forward C-Cuts out to the 33. Stops and sets4. Backward C-Cuts to the 25. Butterfly Slide to the 46. Butterfly slide to the 57. Butterfly slide back to the 28. Backward C-Cuts to the 1",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "Crease Movement #1",
    "url": "https://weisstechhockey.com/crease-movement-1/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/crease.jpg",
    "video_url": "https://www.youtube.com/embed/b85-D8LtNwc?wmode=transparent",
    "instructions": "When doing this drill, make sure the goalie is performing his or her moves properly and getting in the proper stance. Don’t let your goalies try to do the drill too fast to maintain proper form. Make sure they are getting in the proper Post Knee Up and doing the proper Butterfly Slide. We are working on the following movements and positions:\n1. T-Push2. Reactionary Butterfly3. Butterfly Slide4. Stance5. Post Knee Up\nHere’s the diagram:\nCrease Movement #11. T-Push across, square up to puck2. T-Push back to center, square up to coach3. T-Push to post, either hug post or use post-knee-up position4. T-Push back to center, square up to coach5. Repeat to the other side\nNotes: get out to the top of the crease in each position. Do it in 20-30 second segments for conditioning. Repeat the drill using butterfly slide. Do this type of drill every single practice!\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "HockeyVision Training Pucks",
    "url": "https://weisstechhockey.com/hockeyvision-training-pucks/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/11/DSC_0036.jpg",
    "video_url": "https://www.youtube.com/embed/ZlniRlnGoIs?wmode=opaque",
    "instructions": "HockeyVision Training Pucks are a great way to train yourself to rely less and less on seeing the puck, which will then allow you to stickhandle with your head up, enabling you to see more of the play.\nHockeyVision Training Pucks are white, with a black dot in the middle. The black dot comes in three sizes (large, medium, and small). The idea is to work your way down from the large, more-visible dot to small, less-visible dot, training your eye to not have to see as much of the puck while stickhandling.\nThese pucks are available in on-ice and off-ice models. The on-ice pucks are made of rubber (same as a regulation puck), and the off-ice ones are made of a high-density plastic (HDPE if I’m not mistaken), which allows them to slide really well on flooring tiles or a skill pad.\nEnjoy!",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "Post Awareness Drill",
    "url": "https://weisstechhockey.com/post-awareness-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/postawareness.jpg",
    "video_url": "https://www.youtube.com/embed/SPoRmWQcmD4?wmode=transparent",
    "instructions": "This post awareness drill offers lots of possibilities. If you want to progress past just taking shots on this drill, give the players the option to carry the puck across the net/zone before they shoot.\nHere are the goalie’s objectives on this drill:\n1. Post Awareness2. Rebound Control and Recovery3. Post Recovery4. Post-knee-up position (Post Load)\nHere’s the diagram and drill explanation:\nPost Awareness Drill1. Goalie starts on the post2. Player 1 leaves without puck, pivots from forward to backward at about the hashmarks, and receives a pass from Player 23. After receiving the pass, Player 1 pivots and skates forward around the far cone, then drives to the high slot for a shot on goal4. Goalie follows the puck, squaring up to the shot5. After the shot, Player 1 positions himself for a rebound. Goalie gets back to the post with urgency6. Player 2 drives around the middle cone (with puck), and takes shot. Player 1 jumps on the rebound if it’s within the green area7. After Player 2’s shot and rebound, Player 1 gets back in line. Player two positions himself for Player 3’s rebound. Goalie gets back to the post.8. Player 3 drives around the low cone and shoots. Player 2 rebounds, then gets back in line. Player 3 positions himself for a rebound, and the drill repeats.\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "Post-Knee-Up Drill",
    "url": "https://weisstechhockey.com/post-knee-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/02/postkneeup.jpg",
    "video_url": "https://www.youtube.com/embed/yqV8GEqTs9E?wmode=transparent",
    "instructions": "The Post knee up save is a controversial yet solid selection. It is controversial because most goalies do not always use it in the correct situations. This particular drill will work on the Post Knee up as well as work on teaching the goaltender to read and react and utilize the save in the correct situation. Here’s the diagram:\nPost-Knee-Up Drill:SEQUENCE 1:1. Goalie starts square to Player 1.2. Player 1 passes low to Player 2, who attacks the net from the side3. Goalie uses Post-Knee-Up positioning4. After the shot, player 2 opens up to the slot for a rebound or a one-time shot5. After Player 2 shoots, Player 1 drives low around the bottom of the circle and either shoots or passes to Player 2\nSEQUENCE 2:1. Player 1 walks out of the corner. He/she has 4 options: Shoot; Pass behind the net with Player 2 walking out for the shot; Pass to Player 3 for a one-time shot; Pass to Player 4 for a one-time shot.\nOption: If Player 1 passes to Player 2, you can give Player 2 the same 4 options again; Shoot, Pass behind the net, or Pass to Player 3 or 4\nAdditional Notes:Since this is a reactionary save, make sure when doing this save you keep the following in mind:\n1. Close all holes by being very compact2. Use only when the puck is in the low post area and close to the net3. When on glove side, keep your glove in 12 o’clock position, right next to head and wide open.4. Keep your blocker and stick in stance position\nDuring this drill, make sure the goalie is moving. After a goal or a freeze, let the goalie get back into the start position. Hope you enjoy.\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "Shuffle T-Pass",
    "url": "https://weisstechhockey.com/shuffle-t-pass/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/10/shuffletpass.jpg",
    "video_url": "https://www.youtube.com/embed/m8k3YAhft5Y?wmode=transparent",
    "instructions": "This drill works on positioning, proper rotation when moving around your crease, proper recovery from a butterfly, playing the puck, and crease awareness. Make sure your goalies don’t cheat in this drill. They should be squaring up to the puck, hugging posts, and get back to their proper post every time on the puck handling portion. Here are the diagrams:\nShuffle T-Pass: Sequence 11. Shuffle from one side of the net to the other, stopping square to each puck, dropping to a reactionary butterfly at each puck2. After arriving at the far post, come back the other way\nNote: Make sure to recover with the proper leg; right leg when going from right to left, left leg when going from left to right.\nShuffle T-Pass: Sequence 2Goalie starts at the post, then skates the following sequence (see our post on the11 Visual Targets for Hockey Goalies)1. Position 112. Position 63. Position 94. Position 15. Position 66. Position 37. Back to Position 118. Repeat the opposite way\nShuffle T-Pass: Sequence 3Play the pucks:1. Ring pass2. Swipe to corner3. Clearing pass4. Straight shot down the ice5. T-Push back to other post6. Ring pass7. Swipe to corner8. Clearing pass\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "The Star Drill",
    "url": "https://weisstechhockey.com/the-star-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/10/stardrill.jpg",
    "video_url": "https://www.youtube.com/embed/Sk503LKaFY8?wmode=transparent",
    "instructions": "If done correctly, this drill will generate create good habits moving around the crease, and the goalies will become more “Crease Aware” (knowing where they are in their crease). Here’s the diagram, as well as a variation to take the concept to the next level:\nThe Star DrillGoalie starts at the post, then skates the following sequence (see our post on the11 Visual Targets for Hockey Goalies)1. Position 112. Position 63. Position 94. Position 15. Position 66. Position 37. Back to Position 118. Repeat the opposite way\nVariationGoalie performs start drill, reacting to the passes of the three forwards1. Forward on the goal line passes to the forward in the middle, then skates to the near dot2. Goalie reacts by skating to Position 63. Middle forward passes back to the forward who made the first pass4. Goalie reacts by skating to Position 95. Forward on the dot passes across to the forward on the other goal line, then retreats back to his or her original position6. Goalie reacts by skating to Position 17. Goal-line forward passes to middle forward, then skates to near dot8. Goalie reacts by skating to Position 69. Middle forward passes back to the forward who just passed to him10. Goalie reacts by skating to Position 311. Forward on the dot passes back across to the forward on the other goal line (who started the drill), then retreats back to his or her original position\nHave the goalies perform this 2-3 times each. As they begin to improve, allow the forwards to shoot at random intervals.\nREMEMBER: have the goalie adjust to the rebound if they are not able to cover or trap the puck.  Create good habits, don’t let them just stop the puck and move to the next area.\nFor more advanced goalies, you can do the same drill but allow the players to move around in a triangle more freely rather than passing and shooting from the designated areas.  When allowing them to move freely in a triangle passing and shooting, they will be working on their offensive attack while giving the goalie a great workout.\nRegards,\nHands",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "Unbelievable Goalie Slide Board",
    "url": "https://weisstechhockey.com/unbelievable-goalie-slide-board/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/09/X-Goalie-Crease-Slideboard-2.jpg",
    "video_url": "https://www.youtube.com/embed/yLQ_-QtIgxM?wmode=opaque",
    "instructions": "Every now and then I come across a hockey training product that just makes me go “wow!” That’s what happened when I first saw theX-Goalie Crease Slideboardfrom XHOCKEYPRODUCTS.\nNow, I’m admittedly NOT a goalie guy. But it’s not hard to tell when something is going to be beneficial for an athlete. Watch the videos I’ve included in this post, and check out how closely this product allows the goalies to mimic their on-ice movements. Incredible!\nHere are a few of the features you should know about:\nRegulation-size CreaseThe X-Goalie Crease Slideboard features anNHL regulation goalie creasethat utilizes Fan-tastic Sports technology along with the “ProHybrid Visual Lead Position System.” This system allows a goalie to develop muscle memory using the same Squareness, Angle and Depth as he uses on the ice.\nCustomizable Movement PatternsThis crease uses adjustable stoppers to create customizable movement patterns. PowerStrides, Shuffles, Pushoffs, Recoveries, Slides and even paddle down wraps can be practiced on our board.\nTwo Challenging Training LevelsThis crease has two challenging levels: Foundation and Elite. Young goalies will want to start by using the crease at the Foundation Level. This level will allow them to get a feel for the system, and begin to build their leg strength and coordination.\nThe Elite Level has stopper placements progressively further out as you approach the top angle. This level will challenge even the most established goaltenders due to the precision needed in angle adjustment, and the power it takes to carry the full distance outside the crease.\nStoppers, Pushers, and Recovery BumperAll stoppers are located on the “Awareness to Squareness” lines. Each line gives the goalie/trainer immediate feedback as to whether or not Squareness has been achieved to a specific angle.\nIn addition to the stoppers, the X-Goalie Crease Slideboard is equipped with a Recovery Bumper. This semi circle railing mirrors the crease line. It is used to execute a recovery or pushoff from your butterfly. The bumper is strategically placed in an ideal position relative to the stoppers for maximum load and power out of your hybrid setup.\nMoving in towards the posts you will find two blue net play stance stoppers. These stoppers are placed off of each post to ensure the goalies feet are 30 degrees off the goal line. This 30 degree angle gives the goalie a solid base while allowing him to see the strong side corner while keeping the weak side blue line angle in his or her peripheral vision. The goalie can lead the play with a quick shuffle, come back to the same post, lead again, then rotate and shuffle 30 degrees back to the opposite post.\nLastly, this crease has paddle down wrap recovery bumpers in place. These arched rails enable the goalie to recover out of a paddle down wrap as if a player makes a pass instead of executing a wrap around.\nConclusionI don’t often wish I were a goalie… (No offense to any of you keepers who are reading this!) I love my position, and I play it well. However, this just looks like A LOT of fun to me, and I’m a little envious to tell you the truth! If you’re a goalie… you’ve gotta check this out.\nWHERE TO GET IT:Currently the X-Goalie Crease Slideboard is only available atXHOCKEYPRODUCTS.COM… in fact, this product is so new, they’re still in “pre-order” mode right now. But you can sign up to get on the pre-order list here:CLICK HERE TO PRE-ORDER\nCheers!\nJeremy",
    "teaching_points": "",
    "category": "Goalie",
    "source": "weisstechhockey"
  },
  {
    "title": "Bednár Skating Warm-up Drill",
    "url": "https://weisstechhockey.com/bednar-skating-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2013/01/bednar_skating_warmup.jpg",
    "video_url": "https://www.youtube.com/embed/vweAR1397ls?wmode=transparent",
    "instructions": "I’ve got a good buddy out in Slovakia who sends me great drills on a regular basis. I usually test them out with my teams, then pass the best ones along to you guys. I’m naming this hockey warm-up drill after him, the Bednár Skating Warm-up Drill. Here’s the diagram:\nBednár Skating Warm-up Drill\n1. Players skate the patterns, with pucks, as diagrammed.2. First player of each line goes at the same time.3. The next player goes ones he receives the pass from the first player of the other line.4. Drill is perpetual.\nNote: Make sure to have players execute at full speed, while maintaining good puck control, and staying low on the pivots.\nEnjoy!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Czech 1-Timer Drill",
    "url": "https://weisstechhockey.com/czech-1-timer-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/czech1timer-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/GCJDuR5wQt0?wmode=transparent",
    "instructions": "Being able to take a 1-time shot in a game situation is an extremely important skill. However, most coaches (myself included!) don’t allocate enough time in practices to let players develop this skill. Here’s a quick-paced 1-timer drill that will help get your players’ shots harder and more accurate! Here’s the diagram and explanation:\nCzech 1-Timer Drill\n1. player 1 walks in and fires a hard bank pass into the quiet zone (area behind the net)2. player 2 picks it up then hits player 1 for a one-time shot3. coach fires a puck into the corner as the shot is being taken4. after shooting, the player 1 peels off into the corner to pick up the dump in, then steps out and hits player 2, who has taken back some ice, for a one-time shot\nEnjoy!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Finnish Half-Ice Drill",
    "url": "https://weisstechhockey.com/finnish-half-ice-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/fin1-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/RwBeJWkKGAs?wmode=transparent",
    "instructions": "Over the past few weeks I’ve posted a few of my favorite half-ice hockey drills. I’ve had some really good response, and a few of our readers even sent me some of their favorite half-ice drills as well… THANKS!!\nThis drill is from Petri Väisänen (from Finland), and is a fantastic half-ice drill. One of the reasons I like this one so much is that it’s very customizable––you can create multiple variations to fit lots of different game situations. I show a few of these variations in the video, but feel free to get creative on this one!\nHere’s the diagram and explanation:\nFinnish Half-Ice Drill\nSequence 1:\n1. on whistle, (D) skates up to blue line and pivots backward2. after the pivot, (C) dumps a puck into the corner3. (D) picks it up and initiates a breakout using the misdirection4. (F) times the play and swings through to receive a board-side breakout5. (F) attacks the seam and takes a shot (in stride)\nSequence 2:\nSame set-up as above, except add a second defenseman, and use a reverse.\nSequence 3:\nInclude a 1 on 1.\nEnjoy!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Give and Go Corner Drill",
    "url": "https://weisstechhockey.com/give-and-go-corner-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/03/ggcorner-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/FooVh6kWnr?wmode=transparent",
    "instructions": "This is an awesome drill for the really young players. It works on a number of key skill elements such as giving and receiving passes, skating to a receiving zone, power turns with the puck, and shots. Here’s the diagram:\nGive and Go Corner Drill1. Quick give and go with explosive start out of the corner2. Skate around the cone and take a shot with your feet moving\nNote: Teach your players to call for the pass back. It’s never too early to teach communication!\nEnjoy!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Give and Go Shooting Drill",
    "url": "https://weisstechhockey.com/give-and-go-shooting-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/givego-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/JX3O1vZNrQs?wmode=transparent",
    "instructions": "This drill is simple and straight to the point. Players must learn to read the pressure, get a pass back to the corner, and execute a give-and-go. This is a situation that happens again and again in games. Learn it and use it! Here’s the diagram and explanation:\nGive & Go Shooting\n1. first player passes out to point man – then attacks2. point man bank passes back to next player in line3. receiver executes a give and go with point man4. point man shoots5. player who attacked becomes new point man\nEnjoy!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Long/Short Passing",
    "url": "https://weisstechhockey.com/halficehockeydrills-2/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/longpass-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/KMuT787lbFI?wmode=transparent",
    "instructions": "This is a bit of a “2 for 1” half ice hockey drill, since it’s a sequential drill with a long pass, and a short pass. This drill should be executed at a quick pace, so whistle timing is very important here. Have your players focus on executing hard, accurate, stick-to-stick passes––especially on the cross-ice pass. This is a great drill for all ages and skill-levels! Here’s the explanation and diagram:\nLong/Short Passing\nOption 1 – Long Pass1. First player leaves line and skates through the cones as shown.2. Next player in line fires a hard, stick-to-stick, cross-ice pass.3. First player receives pass, skates up around the NZ cone, and fires a shot on net.\nNOTE: make sure to time your whistles so players aren’t skating in front of shots.\nOption 2 – Short Pass1. First player leaves and does a tight turn around the first cone.2. Next player in line floats a “saucer pass” over the stick and onto the stick of the receiver.3. First player skates up around the NZ cone, and fires a hard shot on net.\nNOTE: be sure to keep a quick whistle pace during this drill.\nJeremy",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Slovakian Agility Race",
    "url": "https://weisstechhockey.com/slovakianagilityrace/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/slovakian-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/VxBl7qFdVDM?wmode=transparent",
    "instructions": "Since I started this blog back in 2008, I have met a lot of really cool hockey folks. Believe it or not, it has made me a better coach! I have had the opportunity to exchange drills from coaches all over the world. I make a point to work my way through most of these drills, and pass the best ones on to my “readers” here on the blog.\nI usually try to credit the drill to the person who sent it to me. However, many times the drills that come in are in other languages… as is the case with this one from my good buddy Ján Bednár. Ján has sent me A LOT of drills over the past year or so! Since he is from Slovakia, I’ve named most of his drills the “Slovakian ___________” (insert drill description).\nSo – here you go, another fantastic drill from Ján Bednár, the “Slovakian Agility Race.”\nSlovakian Agility Race\n1. Player from each line skates through the cones as shown2. Pivot at each turn3. Winner takes the puck and tries to score4. Loser backchecks\nEnjoy!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Window Drill",
    "url": "https://weisstechhockey.com/window-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/02/window-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Y3jIofpLP5I?wmode=transparent",
    "instructions": "I love the Window Drill for a few reasons: It’s easy to set up, easy to execute, you can run it half ice, and it’s extremely effective for working on hockey crossovers!\nAs you run this drill with your team, make sure you emphasize that the players MUST keep their feet moving throughout the entire “window.” Also, teach them to use puck protection tactics as they execute their crossovers.\nWindow Drill\n1. On whistle, first player from each line explodes full speed to the blue line2. At the blue line, players enters into the “window” zone – and maintains crossovers through the entire window3. After exiting window, player shoots with head up and feet moving\nEnjoy!!",
    "teaching_points": "",
    "category": "Half Ice Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "\"Precision\" Practices, and When to Use Them",
    "url": "https://weisstechhockey.com/precision-practices-and-when-to-use-them/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/quadpass-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Hclx8eHPPnc?feature=oembed",
    "instructions": "I was asked to run a practice this past Saturday for my friend who coaches the local high school team. Their playoff schedule had changed, and this practice was scheduled at the last minute. Unfortunately, it was scheduled when he would be out of town with a prior engagement.\nNormally, this wouldn’t be a huge deal. But in this case it was. This was what will end up being the last practice of the season. And if the team wins out the rest of their games in playoffs, it will have been the last practice before a stint of 4 games in 7 days. So it needed to be the right kind of practice to suit the needs of the team at this specific moment.\nAs I was consulting with the head coach, we came to the conclusion that this ought to be a “precision” practice. Meaning, the focus would be on skill details and precision, rather than physicality. We decided to work on passing, timing, shooting, skating & puckhandling, as well as some touch-ups on a few systems elements.\nSo as I was designing the practice plan, I was thinking in terms of an NHL game-day skate. I wanted it to be a tune-up. We had an hour-and-a-half time slot, so I knew we could take our time and iron out all the wrinkles before rushing to the next drill.\nSo I put together this practice plan. You can download it here:\nBecause of the situation, timing of the year, and the fact that I’m not the regular coach, I decided to over plan. So I put in more drills than we would likely get through, and figured I’d adjust in real time based on the needs of the group, and how the skills and concepts were looking.\nOn a couple of drills, we took less time than budgeted. And on other drills, we took more time, and focused in until they looked good.\nWe spent quite a bit of time on the drill in the video above. I borrowed this one from a great skills coach namedDanny Heath.  It incorporates short touch passes, agility skating, and some timing elements, then finishes with a shot.\nThere’s a time and a place for everything. And it’s up to us as coaches to determine what our players need, and when. There are times when you need to have a high intensity “conditioning” practice. There are times when you need to focus on physicality and battling. There are times when systems and positional play need to be addressed. And there are times when you need to dial in the detail elements of the game.\nI hope this example helps!\nEnjoy 🙂\nJeremy",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "\"S\" Warm-up Drill",
    "url": "https://weisstechhockey.com/hockey-warm-up-drills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/09/swarmup-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/5nyO-RU5WLc?wmode=transparent",
    "instructions": "This is a great little high-speed hockey warm-up drill that incorporates many different elements of the game, including skating, passing, and shooting. I typically have my defensemen acting as the passers, since that neutral zone “d-to-d” pass is something they will need to perform over and over in games.\nMake sure to push those defensemen to make quick, hard, stick-to-stick passes to each other, and then fire that cross-ice pass hard and accurately.\n“S” Warm-up Drill\n1. Forwards line up in the corner, two defensemen on each blue line2. On whistle, first forward in each line passes out to the near defenseman3. Defensemen execute D to D passes while forward skates the “S”4. Cross-ice pass to the forward, who attacks 1 on 0\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "\"Snake\" Shooting Drill",
    "url": "https://weisstechhockey.com/snake-hockey-shooting-drills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/snake1-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/vBpf7DzMw_E?wmode=transparent",
    "instructions": "This could be one of the most basichockey shooting drillsout there… but it is also one of the most effective because of the concepts that can be applied. Remember to have your players shoot in stride if they’re on their forehand, and to use theirInside Mohawkif they’re on their backhand. Here’s the diagram and explanation:\nSnake Drill\nOption 1:1. players line up in corner2. on whistle, first player in line skates up and around the top of the circle, attacking the “seam”3. if on forehand, player shoots in stride, if on backhand, player executes a mohawk, and shoots from the forehand4. after shot, players line up in opposite corner\nOption 2:1. Basic snake – add coaches for “token” resistance2. Start by drive skating through the coaches, using puck protection3. Then switch to an outward facing inside mohawk as the protection move at each coach\nOption 3:1. First player leaves without a puck2. Next player in line passes out for a one-time shot3. Use Mohawk if on backhand\nCheers!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "1 on 0 Headman Drill",
    "url": "https://weisstechhockey.com/1-on-0-headman-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/10/1on0headman-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/EKHF7XaM09k?wmode=transparent",
    "instructions": "I picked up this drill from the Scott Fukami drill collections available to DrillDraw owners. These drill collections are phenomenal, and are filled with hundreds of REALLY GOOD, well-drawn drills. I highly recommend picking up all three drill sets. Here’s the diagram and explanation:\n1 on 0 Headman\n1. On the whistle, (1) passes a puck to the (D).2. D to D pass, then a return pass to (1).3. (1) receives the puck and makes a stretch pass to the “Ghost Man” (Gh), who has skated across the neutral zone.4. (Gh) takes a shot.5. (2) passes a puck to the (D).6. D to D pass, then a return pass to (2)7. (2) hits (1), who has turned back up the ice.8. (1) shoots, and (2) becomes the next “Stretch Man”\nThe drill is continuous with (1) making the next pass to the (D) and the stretch pass to (2).\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "3 Man 3 Zone Timing Drill",
    "url": "https://weisstechhockey.com/3-man-3-zone-timing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2021/02/3man3zone-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/acj6N8YdR9M?feature=oembed",
    "instructions": "This is a variation on an old classic, the3 Zone Timing Drill, which is one of my all-time favorites!\nAlthough flow and timing drills have lost some popularity in recent years, due to the hype surrounding small area games, I do believe there’s a time and place to make effective use of full-ice flow and timing drills, especially for advanced teams.\nThis style of drill is not only fun, but is great for conditioning, and awesome for getting high-quality reps in for specific game patterns.\nHere’s how the drills works:\nDrill Description:\nNote: for the timing to work, the next 3 players should leave as the Passer is making the first pass.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "3 Man Weave",
    "url": "https://weisstechhockey.com/3-man-weave/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/03/3manweave-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/SFKrGHIONwI?wmode=transparent",
    "instructions": "Use the 3 Man Weave to teach and reinforce key concepts like timing, support, and offensive zone triangulation. As skill progresses, increase the demand on the players. I like to insist that all my lines are able to get in three stick-to-stick passes before the far blue line, then a controlled attack on net. Here’s the diagram:\n3 Man Weave1. On whistle, center passes to one of the two wingers, who is cutting through the middle for a pass.2. After making the pass, the passer loops in behind the receiver, providing back-side support, then explodes up ice to become the front side option for the 3rd player.3. Receiver picks up the pass, then head mans to the 3rd player, who is providing a front-side passing option4. Passer loops in behind the receiver, and all three players weave down the ice.5. After crossing the blue line, the puck carrying forward becomes F1 and drives wide, the second forward becomes F2 and drives to the far post, the third forward becomes F3 and trails, thus creating the “Attack Triangle”\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "3 Pass and Shot Drill",
    "url": "https://weisstechhockey.com/drill-3-pass-and-shot-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/3pass-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/dFrDDJQprOk?wmode=transparent",
    "instructions": "The “3 Pass and Shot Drill” is a great Hockey Drill that can be utilized in many different practice scenarios. I like to use it as a warm-up drill, but it can also be used to develop passing and timing concepts, or to work on one-touch passes or shooting. Here’s the diagram:\n3 Pass and Shot Drill\n1. Players line up in two lines, at the blue lines2. Each line has pucks3. On the whistle, the first player from each line skates across the blue line and receives a pass from the opposite line4. The receiver controls the pass and gives a pass back to the player who passed to him5. After giving the return pass, the player circles around, presenting himself as an option in the receiving zone,  where he receives a pass from the line he originally left from6. Receiver turns up ice and takes a shot, then skates to the back of the other line\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "3 Shot Hockey Warm-Up Drill",
    "url": "https://weisstechhockey.com/3-shot-hockey-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2017/01/3shotwarmup-1-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Qnvex6GHnGs?wmode=transparent",
    "instructions": "This is a great drill to get players’ legs going at the beginning of practice. It’s high tempo, and combines agility skating, with puck control, and shooting in motion. Enjoy!\n3 Shot Hockey Warm-Up Drill:1. Players line up in diagonal corners2. On whistle, 3 players from each line leave together3. Player 1 drives wide and shoots4. Player 2 cuts around the 1st and 2nd cones and shoots from the middle5. Player 3 cuts around the 1st and 3rd cones and shoots from the far side6. All shots should be from tops of the circles\nVARIATIONS: designate different shot types",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "3-Zone Timing Drill",
    "url": "https://weisstechhockey.com/3-zone-timing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/09/3zonetiming-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/5OmFFXANB1Y?wmode=transparent",
    "instructions": "I’ve been using the 3-Zone Timing Drill for years as both a player and a coach. I love it because it simulates passing patterns that happen over and over in game situations––particularly in breakouts and regroups. This is a “classic” flow drill with lots of passing, timing, and shooting.\nMake sure you check out theOne-Touch Timing Drillas a precursor to this drill.\nHere’s the diagram and explanation:\n3-Zone Timing Drill\n1. To start the drill, 3 players leave from the corner (after that only 2 leave from then on)2. First player shoots, picks up a puck from the circle, and hits the second player in the first green receiving zone3. Receiver controls puck, then hits the third player in the second green receiving zone4. Receiver takes a shot, picks up a puck from the circle, and hits the first player of the other line in the first red receiving zone.5. Drill continues perpetually.\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "4 Blueline Warm-up",
    "url": "https://weisstechhockey.com/4-blueline-hockey-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/09/4blueline-1024x549.jpg",
    "video_url": "https://www.youtube.com/embed/dayUUG3zNd4?wmode=opaque",
    "instructions": "The 4 Blueline Warm-up is part of the Scott Fukami drill collections available through DrillDraw. If you already own DrillDraw, you should really take a look at these. They’re phenomenal. This drill has 5 phases, or sequences. Here’s what they look like:\nPHASE 1:**Drill starts on the whistle. Both ends at the same time.\nOn the whistle, (1) skates across the blueline and makes a pass to (2). Return pass to (1) for a shot on the (G).\nStretch Pass : see Seq. # 2.\nPHASE 2:**Drill starts on the whistle. Both ends at the same time.\nStretch Pass :\nOn the whistle, (1) skates across the blueline and makes a pass to (2). Return pass to (1). (1) makes a pass to (3) and continues to the blueline. (3) makes a stretch pass to (1) on the opposite blueline for a shot on the (G).\nFull-circle Stretch Pass : see Seq. # 3.\nPHASE 3:**Drill starts on the whistle. Both ends at the same time.Full-circle Stretch Pass : (only one side shown)\nOn the whistle, (1) skates across the blueline and makes a pass to (2). Return pass to (1). (1) makes a pass to (3) and continues full-circle to the opposite blueline. (3) makes a stretch pass to (1) on the opposite blueline for a shot on the (G).\nDouble Regroup Stretch Pass : see Seq. # 4.\nPHASE 4:**Drill starts on the whistle. Both ends at the same time.\nDouble Regroup Stretch Pass : (only one side shown)\nOn the whistle, (1) skates across the blueline and makes a pass to (2). Return pass to (1). (1) makes a pass to (3) and continues full-circle to the opposite blueline. (1) turns to the boards. (3) makes a stretch pass to (1) for a shot on the (G).\nPHASE 5:**Drill starts on the whistle. Both ends at the same time.\nMohawk Turn Stretch Pass : (only one side shown)\nOn the whistle, (1) skates across the blueline and makes a pass to (2). Return pass to (1). (1) makes a pass to (3) and makes a mohawk turn to the boards. (3) makes a cross-ice pass to (2). (2) makes a stretch pass to (1) on the opposite blueline for a shot on the (G).\nEnjoy!!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "4-Pass Hockey Warm-Up Drill",
    "url": "https://weisstechhockey.com/4-pass-hockey-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/4pass-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/Nrsx-6ye1Bg?wmode=transparent",
    "instructions": "Here’s a fast-paced warm-up drill that incorporates skating, passing, and shooting. Plus it works multiple angles for the goalies. As always, here’s the diagram and explanation:\n4-Pass Warm-Up\n1. 4 lines on the goal line with pucks.2. Line 1 skates up to blue line, turns toward line 3 and receives a pass from line 3, then turns up ice and attacks 1 on 03. Line 2 receives from line 4, line 3 from line 1, and line 4 from line 2\nEnjoy!!!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "5 Pass One Touch",
    "url": "https://weisstechhockey.com/5-pass-one-touch/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/04/Screenshot-2019-04-03-14.37.08-1024x487.png",
    "video_url": "https://www.youtube.com/embed/T_Dvn10-lMo?feature=oembed",
    "instructions": "For anyone who has questions about the software in this video, I’m using CoachThem at the beginning to walk through the diagram, then Hockey Coach Vision to show the animated drill in action. I’ve got discounts set up for both softwares if you’re interested:\nNotes:\nCLICK HERE FOR FULL PRINTOUT",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Attack Triangle Sequence",
    "url": "https://weisstechhockey.com/attack-triangle-sequence/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/at3-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/2tKNXKXejZk?wmode=transparent",
    "instructions": "Many youngsters have a tendency to skate the puck straight at the opposing defenseman, when attacking the offensive zone. I believe that our young athletes can be taught to use structured attack systems from a very early age. The Attack Triangle Sequence is one of my favorite drills to begin teaching these concepts. Here’s the diagram and explanation:\nAttack Triangle Sequence\nPhase 1:1. player (F1) leaves without puck, cuts across neutral zone2. receives pass in stride3. drives wide and shoots4. after making the pass, first player in other line does the same thing\nPhase 2:1. first player (F1) does same thing as in phase 1.2. second player in same line becomes F2. cuts inside first cone, then drives wide and cuts to the net for a 1-timer\nPhase 3:1. F1 and F2 do the same thing as in phase 22. Player who makes pass becomes F3 and follows up the puck carrier to form an attack triangle3. work whatever options you need\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Boost Foot Speed with this Great Hockey Agility Drill",
    "url": "https://weisstechhockey.com/my-favorite-hockey-agility-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2024/07/Circle-Agility-Drill-Weiss-1024x802.png",
    "video_url": "https://www.youtube.com/embed/JVHRnrT-ixc?feature=oembed",
    "instructions": "Speed is one of the most important aspects of today’s game.\nTrue hockey speed is comprised of two parts: Skating Power and Foot Speed. A player will not reach his or her full skating potential until he or she gets good at both.\nPower and foot speed can be worked into manyhockey drills, which will help young players to improve their overall game.\nThe Circle Agility Drill one of my favorite on-ice agility drills. I like it because it develops quick feet while skating forward, backward, as well as side-to-side.\nHere’s the diagram and explanation for theCircle Agility Drill:\nAlways facing the cone:\nVariations:\nCLICK HERE TO PURCHASE (use code JWEISS15 for 15% off at checkout) >>\nJeremy Weiss (with his translator) presenting at a hockey coaching symposium for the Russian Federation in Moscow—2018.\nHockey coach and international consultant, Jeremy Weiss, has worked with thousands of coaches worldwide since 2008 to help produce championship teams at every age and skill level.\nHe is known internationally through the work he has done online. In 2008 he invented “digital chalktalks” which combined screen sharing with drill diagramming software, to produce a training experience nobody had ever seen before. His YouTube following quickly grew to over 19,000 subscribers, and he has produced over 130 training videos.\nJeremy runs a development blog for coaches, which has over 280 posts. He is the author of 10 hockey books for coaches, and is the editor of Hockey Development Magazine.\nHe was trained in the Eastern European style as a pre-teen, by his Czechoslovakian skills coach, and competed internationally as a “Wexford Raider” among the top youth hockey programs in the world including Russia, Czechoslovakia, Finland, and top teams in his home province Ontario, Canada.\nHe majored in Exercise Sciences at Brigham Young University, and subsequently worked as a Personal Trainer, where he continued to study and develop ideal training methods for hockey.\nHe has incorporated the very best pieces from the various training styles he has been involved in, and has built a world-class off-ice strength and conditioning program that fits the specific needs of hockey players.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Butterfly Passing Drill",
    "url": "https://weisstechhockey.com/butterfly-passing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/04/butterfly_passing.jpg",
    "video_url": "https://www.youtube.com/embed/TArEWwv-KN0?wmode=transparent",
    "instructions": "Butterfly Passing is a great drill to work on passing fundamentals with youngsters, and to iron out technical “wrinkles” in more experienced players. Although the drill itself is simple, players should use this drill as an opportunity to work on passing accuracy in stride, and should focus on precise execution at full speed. Here’s the diagram:\nButterfly Passing Drill:\n1. Two lines at one end, the width of the goal posts2. Players skate in pairings all the way down the ice, passing back and forth while maintaining stride3. At far end, players peel off, around the bottom of each’s respective circle, then skate back making cross-ice passes back into the zone they started from\nVariation:have d-men skate backward\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "C-Pass Give and Go Drill",
    "url": "https://weisstechhockey.com/c-pass-give-and-go-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/01/c-pass-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/ZZRUSl1nM0E?wmode=transparent",
    "instructions": "The C-Pass Give and Go is an awesome drill to get your players moving. It is high tempo, and works a lot on giving and receiving passes in motion. This drill should be done at full speed. As your players get the hang of this drill, start pushing them to keep their feet moving throughout the entire drill. Here’s the diagram:\nC-Pass Give and Go1. First player in each line leaves without a puck, skates the “C,” then receives a pass from the next player in line at about the top of the circle.2. After receiving the pass, the puck carrier skates into the neutral zone and executes a give and go pass with (P).3. After picking up the return pass, the puck carrier steps into the high slot and lets a shot go.\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Chaos Stickhandling Drill",
    "url": "https://weisstechhockey.com/drill-chaos-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/chaos-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/MguaJV2UUCw?wmode=transparent",
    "instructions": "The Chaos Drill is a simple and effective hockey stickhandling drill that is sure to get your team flying! Make sure you stress that your players keep their feet moving through the cones, shoot in stride, and KEEP THEIR HEADS UP! As always, here’s the diagram and explanation:\nChaos Drill1. players line up in corners2. one player from each line leaves on the whistle3. players skate full speed through the cones, keeping their heads up, and feet moving the entire time4. after deking through the cones, players shoot on respective goalies",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Circle Passing: 5 & 6-Man Versions",
    "url": "https://weisstechhockey.com/circle-passing-5-6-man-versions/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/01/Screenshot-2019-01-23-12.05.38-1024x571.png",
    "video_url": "https://www.youtube.com/embed/iMt4QPKanQs?feature=oembed",
    "instructions": "When teaching new passing skills, I generally like to start with stationary passing. We may spend more or less time at this phase, depending on the age and skill level of the players I’m working with. But the intent is to workout themechanicsof the skill, without any other variables.\nThe eventual goal is to be able to perform complex passing and timing drills, game situation drills, area passing, with game like speed and game like pressure… but we have to build up to that point.\nThis Circle Passing Drill is a great “interim” drill to build from stationary drills to the more complex stuff described above. It incorporates a bit of movement, and requires more thinking, but isn’t full-blown game pressure.\nThe basic, 5-man version of this drill can be used with U8’s, and the 6-man version can be developed and used effectively all the way up through college levels of play.\nNOTES: Designate which pass type you want to work on.\nNOTES:\nDOWNLOAD PDF PRINTOUT HERE",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Cross-Ice 3 Pass & Shot Drill",
    "url": "https://weisstechhockey.com/cross-ice-3-pass-shot-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/01/Screenshot-2019-01-09-11.15.24-1024x495.png",
    "video_url": "https://www.youtube.com/embed/63PMAJn7gnU?feature=oembed",
    "instructions": "Variation: If it’s going well, add the stretch pass variation as shown in the blue lines\nDOWNLOAD PDF PRINTOUT HERE",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Cycle Give and Go Drill",
    "url": "https://weisstechhockey.com/cycle-give-and-go-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/cycle_give_and_go.jpg",
    "video_url": "https://www.youtube.com/embed/9jqpDBtXdCg?wmode=transparent",
    "instructions": "The Cycle Give and Go Drill is an awesome way to introduce cycling concepts, and offensive attack patterns. Here’s the diagram:\nCycle Give and Go Drill\n1. Player from line 1 leaves with the puck and walks up the boards, then cycles back to player from line 22. Player from line 1 drives through the seam for a give and go pass, receives the pass from player 2, then executes a one-time-shot\nVariation: After receiving the pass back from player 2, player 1 touch-passes to player 3 or 2 for a one-time-shot\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Dangle Glove Hockey Stickhandling Aid",
    "url": "https://weisstechhockey.com/dangleglove/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/09/DSC_0009.jpg",
    "video_url": "https://www.youtube.com/embed/6zZmz4pXQvA?wmode=transparent",
    "instructions": "Every once in a while, a product comes along that just “makes sense.” The Dangle Glove is one of them. This special glove helps to “force” players to use proper technique while stickhandling.\nDangle Glove Overview:I’m sure at some point you’ve seen players stickhandling using a piece of PVC pipe, or a toilet paper tube on their bottom hand. This old training technique has been around for a long time, and is used to help players develop the habit of using their top hand to control the stickhandle, while their bottom hand acts as a stabilizer. The Dangle Glove takes this training method to a whole new level, allowing for more flexibility in drill types.\nProblems with PVC Pipe Method:Although the old PVC Pipe method is a good start, there are some major limitations to this training method.\nThe Dangle Glove:The Dangle Glove fixes the problems with the old, PVC pipe method. Here’s how they’ve done it:\nConclusion:The updated design of the dangle glove let’s players develop their stickhandling skills in a multitude of situations. It’s great for off-ice use, as well as for use on the ice. It’s a fantastic tool, and one that I definitely recommend!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Double Bank Pass Drill",
    "url": "https://weisstechhockey.com/double-bank-pass-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/02/double_bank_pass.png",
    "video_url": "https://www.youtube.com/embed/kdfIosU1tO8?wmode=opaque",
    "instructions": "The Double Bank Pass Drill is quick paced, and a lot of fun. This is one you should definitely try out on the ice, as the diagram doesn’t always do it justice (at least it didn’t for me!). Here’s the diagram:\nDouble Bank Pass Drill:\n1. 4 lines, each with pucks2. On whistle, two players leave from diagonally opposite lines.3. The ﬁrst player ﬁres a cross-ice pass to the opposite line, then skates up ice to receive the ﬁrst bank pass.4. Receiver steps out to create a good passing angle, then executes a bank pass to the player who passed to him.5. The second player skates further up ice, timing it to be ready to receive the second bank pass from the ﬁrst player in his line.6. Both players attack 2 on 0\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Fast Hands Review",
    "url": "https://weisstechhockey.com/fast-hands-review/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2013/12/Fast-Hands-Hockey-Videos-1.png",
    "video_url": "https://www.youtube.com/embed/S1JPEgbChvI?wmode=transparent",
    "instructions": "I recently had the chance to try out the Fast Hands hockey stickhandling training aid. It quickly became one of my favorite pieces of stickhandling equipment of all time! Here’s what it’s all about:\nDesign:Fast Hands is shaped like a half-octagon, and has five openings, which are just tall enough for a puck to slide under. Each opening has a number, which allows you to prescribe drill sequences to work on various stickhandling skills (i.e. 4, 1, 2, 3)\nDrills:As good a product as Fast Hands is, what REALLY makes it great is to use the drill sequences from the Fast Hands video. Getting your reps in on the prescribed movements will improve your hands FAST. I improved just making the review video above.\nCheck out this video for all 25 Fast Hands drills:\nMy Experience:My experience with Fast Hands is pretty straight forward: It has been AWESOME. Simple design, lots of versatility, tons of drills, and you can use it both on and off the ice!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Figure 8 Shooting and Deflection",
    "url": "https://weisstechhockey.com/drill-figure-8-shooting-and-deflection/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/fig8-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/PZVWRHMiW9k?wmode=transparent",
    "instructions": "Here’s a quick and effectivehockey shooting drillthat incorporates shots from the points, and deflections in front of the net. I like to run this drill from both ends so the forwards get plenty of chances to execute. Encourage your defensemen to fire low, hard shots on net that the forwards will be able to deflect. This is a great game simulation drill for everybody! Here’s the explanation:\nFigure 8 Shooting and Deflection1. Forwards & Defensemen line up as shown2. First forward passes to the near defenseman, then skates around the top of the circle and drives the net.3. Far defenseman fires a low, hard shot for a deflection4. Forward deflects the puck then skates around the other circle and drives the net again.5. Defenseman who received the initial pass fires a low, hard shot for a deflection.6. Forward deflects the puck then stops in front of the net to screen the goalie and get ready for the third shot.7. Middle defenseman fires a low, hard shot. Forward deflects it then drives in any rebound.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Full Ice 3 Pass and Shot Drill",
    "url": "https://weisstechhockey.com/full-ice-3-pass-and-shot-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/10/fullice3pass-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/xUGVA2pBS4c?wmode=transparent",
    "instructions": "This drill is a more difficult version of our regular3 Pass and Shot Drill. In this version the passes are longer, and must be harder. With the right group of players (and the proper number of players), this can be a very fun and effective drill. However, if your players aren’t capable of handling long, cross-ice passes, they’ll spend a lot of time chasing pucks into the corner. See the diagram and explanation below:\nFull-Ice 3 Pass and Shot Drill1. players leave respective lines and skate across the ice2. receive a pass from next player in line, and quickly return the pass3. loop to receive the final pass from the same line they each player left from – receive the puck IN FRONT of the red line4. cut up ice and take a shot\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Hockey Shooting Targets: Sniper's Edge",
    "url": "https://weisstechhockey.com/hockeyshootingtargets/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/04/DSC_0016.jpg",
    "video_url": "https://www.youtube.com/embed/yN5FtefJFV4?wmode=transparent",
    "instructions": "A few months ago, I got my hands on the Sniper’s Edge fromHockeyShot. I had seen this Hockey Targeting System in the past, but hadn’t ever used one before. So, I was excited at the chance to give it a whirl, and was impressed with the experience.\nProduct OverviewTheSniper’s Edgefits over any standard two-car garage door opening, and comes in 2 sizes, 7′ x 16′ or 8′ x 16′ (so make sure you measure the height of your garage door before ordering).\nThe unit comes tightly wrapped in a box – make sure you follow the labeling and DON’T USE A KNIFE TO OPEN THE BOX, as you will risk slicing a hole in your tarp before you even get it open.\nInstallationThe Sniper’s Edge doesn’t come with any of the necessary hard-ware to install it. So you’ll need to pick up the following items from Home Depot or Lowe’s:\nOnce you have the proper hardware, assembly is pretty easy… Just follow the directions included in the box. I put it up myself in about 22 minutes, and it would have been a lot quicker if I had had a partner.\nMy ExperienceOnce your Sniper’s Edge is all set up, just grab aShooting Pad, somePucks, and have at it! This set-up works really well in neighborhood or indoor settings, where you don’t want errant pucks damaging houses, windows, or other valuable items. The Sniper’s Edge is a tarp, so everything hits with a dead bounce and drops straight down.\nAnother cool feature on the Sniper’s Edge is the pocketing system. Anytime you snipe a corner, the puck is caught in the back pocket, and drops down to the bottom of the unit, making clean-up easy (as long as you’re hitting the corners!).\nAll in all, this is a great product, and one I highly recommend!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Hockey Warm-Up Drill: High-Low Shooting",
    "url": "https://weisstechhockey.com/hockeyshootingdrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2024/07/Full-Ice-High-Low-Shooting.jpg",
    "video_url": "https://www.youtube.com/embed/v6O1G6rCba8?feature=oembed",
    "instructions": "Here’s another great hockey drill that I like to use particularly as a warm-up drill. It is quick-paced, and incorporates skating, stickhandling, and shooting in stride. It’s also great for goalies as it gets them moving side-to-side. Players must keep their heads up as they explode through the middle of the ice in opposite directions. Stress that the players keep their feet moving throughout the entire drill. Here’s the diagram and explanation:\nHigh-Low Shooting1. Players are divided into 4 corners with pucks.2. All 4 lines leave at the same time on the whistle.3. Short lines go to first set of cones.4. Long lines go to middle set of cones.5. Players skate full speed through the cones, drive wide, and take a shot while keeping feet moving.6. Players alternate lines each time.\nCLICK HERE TO PURCHASE (use code JWEISS15 for 15% off at checkout) >>\nJeremy Weiss (with his translator) presenting at a hockey coaching symposium for the Russian Federation in Moscow—2018.\nHockey coach and international consultant, Jeremy Weiss, has worked with thousands of coaches worldwide since 2008 to help produce championship teams at every age and skill level.\nHe is known internationally through the work he has done online. In 2008 he invented “digital chalktalks” which combined screen sharing with drill diagramming software, to produce a training experience nobody had ever seen before. His YouTube following quickly grew to over 19,000 subscribers, and he has produced over 130 training videos.\nJeremy runs a development blog for coaches, which has over 280 posts. He is the author of 10 hockey books for coaches, and is the editor of Hockey Development Magazine.\nHe was trained in the Eastern European style as a pre-teen, by his Czechoslovakian skills coach, and competed internationally as a “Wexford Raider” among the top youth hockey programs in the world including Russia, Czechoslovakia, Finland, and top teams in his home province Ontario, Canada.\nHe majored in Exercise Sciences at Brigham Young University, and subsequently worked as a Personal Trainer, where he continued to study and develop ideal training methods for hockey.\nHe has incorporated the very best pieces from the various training styles he has been involved in, and has built a world-class off-ice strength and conditioning program that fits the specific needs of hockey players.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Hymas Square Drill",
    "url": "https://weisstechhockey.com/hockeypassingdrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/hymas-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/lt3xq1cziy4?wmode=transparent",
    "instructions": "One of my players, Nate Hymas, showed me this one a couple of years ago. So, I called this the Hymas Square Drill (or the Wag the Dog Drill – since Hymas is one of those players who loves to give input). Either way, this is a great, quick-paced, heads up passing drill. Here’s the diagram and explanation:\nHymas Square Drill1. Players in opposite corners pass straight ahead2. Passes go around the square3. Players who started the drill skate around the circle and receive pass back from the same line they left from\nOption 2: Similar to the first option, but now incorporates backward skating. See Diagram 2\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Inside Mohawk",
    "url": "https://weisstechhockey.com/powerskatingdrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/mohawk-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/MsAiPzVm7tc?wmode=transparent",
    "instructions": "The Mohawk can be used while shooting, deking, pivoting, slipping checks… the options are limitless. Players who become proficient with the mohawk will find themselves performing it instinctively in games. Here’s the diagram and explanations for the Mohawk Square Drill.Click Here for the Snake Drill mentioned in the video.\nMohawk Square1. Players start on the boards, about half way between the two cones2. On the whistle, players skate around the square, executing a mohawk around each cone3. After a few times through, go the other direction\nNote: Once the players can execute the move well, put a puck on their sticks and have them do a toe drag with their mohawk at each cone.\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Introduce Important Timing Tactics with the Center Lag Timing Drill",
    "url": "https://weisstechhockey.com/drill-center-lag-timing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2024/08/Center-Lag-Timing-1024x490.png",
    "video_url": "https://www.youtube.com/embed/gYtyFWze_rQ?feature=oembed",
    "instructions": "Timing in hockey is a skill that requires not only physical ability, but mental ability as well. It is not uncommon to see young players buzzing around in practices or games – they appear to only have one speed: FULL SPEED.\nSince they’re working hard, they think they’re doing a good job… In reality, it is the player who arrives in theright spot, at the right time, with speedthat will be the most effective.\nTeach your players to pass to designated receiving areas, not necessarily to players. The responsibility lies with thereceiverto make the play work. The receiver must select the proper route to the receiving zone so that he or shearrives on time, with speed. He or she must be ready to receive the puck when thepasseris ready to move the puck, that’s timing!\nThe Center Lag Timing Drill is a fantastic entry level drill to introduce timing concepts to your players.\nHere’s the diagram and explanation:\nCenter Lag Timing Drill Explanation\nVariations:\nEnjoy!\nCLICK HERE TO PURCHASE (use code JWEISS15 for 15% off at checkout) >>\nJeremy Weiss (with his translator) presenting at a hockey coaching symposium for the Russian Federation in Moscow—2018.\nHockey coach and international consultant, Jeremy Weiss, has worked with thousands of coaches worldwide since 2008 to help produce championship teams at every age and skill level.\nHe is known internationally through the work he has done online. In 2008 he invented “digital chalktalks” which combined screen sharing with drill diagramming software, to produce a training experience nobody had ever seen before. His YouTube following quickly grew to over 19,000 subscribers, and he has produced over 130 training videos.\nJeremy runs a development blog for coaches, which has over 280 posts. He is the author of 10 hockey books for coaches, and is the editor of Hockey Development Magazine.\nHe was trained in the Eastern European style as a pre-teen, by his Czechoslovakian skills coach, and competed internationally as a “Wexford Raider” among the top youth hockey programs in the world including Russia, Czechoslovakia, Finland, and top teams in his home province Ontario, Canada.\nHe majored in Exercise Sciences at Brigham Young University, and subsequently worked as a Personal Trainer, where he continued to study and develop ideal training methods for hockey.\nHe has incorporated the very best pieces from the various training styles he has been involved in, and has built a world-class off-ice strength and conditioning program that fits the specific needs of hockey players.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Leafs Warm-Up Drill",
    "url": "https://weisstechhockey.com/leafs-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/12/leafswarmup.jpg",
    "video_url": "https://www.youtube.com/embed/ZJHmaChpc88?wmode=transparent",
    "instructions": "This is a fun one that touches on quite a few different skills, including backward skating, pivots, passing, drive skating, and shooting. Here’s the diagram and explanation:\nLeafs Warm-Up:\n1. Players on each side of center at boards2. First player leaves, skating backward, receives pass from second player in line–always receives pass on the side of his body he’ll be turning to3. After receiving the pass he/she opens up and skates forward around the cone, driving wide to the net.4. After shot, player lines up on opposite side\nVariations: a) go around near cone instead of far cone; b) after pass, player joins for a 2 on 0",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Mohawk Agility Drill",
    "url": "https://weisstechhockey.com/mohawk-agility-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/11/mohawk_agility.jpg",
    "video_url": "https://www.youtube.com/embed/y9l8a7Ww0dE?wmode=transparent",
    "instructions": "",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Mohawk Square Drill",
    "url": "https://weisstechhockey.com/mohawk-square-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/04/mohawk-snake-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/g12nasyrrvs?wmode=transparent",
    "instructions": "The Mohawk Square Drill, and the Full-Ice Snake Drill are two phenomenal ways to work on inside mohawks with your team. I use these two drills to work up to more difficult mohawk drills like the “Snake” Shooting Drill––and of course, the Snake Shooting Drill is a precursor to many other situational drills in which the mohawk can be used.\nIn this video, I make reference to two previous videos:\nClick Here to see theMohawk in ActionClick here for theSnake Shooting Drill\nHere are the diagrams and explanations for the drills mentioned in the video:\nMohawk Square1. Players start on the boards, about half way between the two cones2. On the whistle, players skate around the square, executing a mohawk around each cone3. After a few times through, go the other direction\nNote: Once the players can execute the move well, put a puck on their sticks and have them do a toe drag with their mohawk at each cone.\nFull-Ice Mohawk Snake\n1. Players start in corner.2. Each player weaves through the cones, executing a mohawk around each cone.3. Maintain the mohawk behind the net, then come back.\nNote: Add a puck and a shot at the end as players begin to improve.\nEnjoy!!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "One-Touch Timing",
    "url": "https://weisstechhockey.com/one-touch-timing/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/one-touch-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/f_EUNnR4fY4?wmode=transparent",
    "instructions": "If you’ve followed me at all over the past few years, you know I love to use progressions to develop new skills. This is a great example of a simple drill that can be progressed into a more complex version, the3-Zone Timing Drill.\nAs you begin introducing timing concepts to your players, remember to stress that it is better to be late and accelerating into the pass, than to be early and slowing down. Here’s the diagram:\nOne Touch Timing Drill:Designate a Passer (P) for the first time, just to start the drill.\n1. first player from each line at one side of the ice leave together2. low man swings to receive the pass, then one-touch passes to his partner swinging through at mid-ice.3. receiver shoots, passer picks up a puck and passes to the low man of the other line4. drill is perpetual\nNOTE: this is a GREAT precursor to the3-zone timing drill.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Overspeed Agility Drill",
    "url": "https://weisstechhockey.com/overspeed-agility-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/overspeed-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/5g4Mh2PAn2k?wmode=transparent",
    "instructions": "I’ve mentioned before that technical skating drills can be boring and monotonous for many youngsters. The problem is that skating ability is SO essential… you HAVE to find ways of developing it! One method I’ve found to work with youngsters––and older players too :)–is to add a shot at the end of a skating drill. This tactic turns it from a skating drill into a shooting drill, and is much more fun and motivating for the players.\nStart with no pucks. As your players progress, add a puck, then start making them do 5 push-ups for each time they lose the puck. Players must be able to execute these skating maneuvers at full speed without mishandling the puck. Add more pressure by assigning push-ups if the next player in line catches you. FULL SPEED IS THE KEY HERE – PUSH YOUR PLAYERS OUT OF THEIR COMFORT ZONE!! Here’s the diagram and explanation:\nOverspeed AgilityFirst player from each line go at the same time\n1. Player starts at the edge of the circle and side steps to the center ice faceoff dot.2. Player stops at the dot, then sidesteps back to the edge where he/she started and quickly crosses over around the circle (feet moving quickly – focus on overspeed here).3. Player continues around the circle, then skates out to the neutral zone faceoff dot, pivots and skates backwards to the opposite faceoff dot.4. Player pivots forward and takes a shot on net.\nNote: drill can be done with or without a puck\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Passing Medley",
    "url": "https://weisstechhockey.com/passing-medley/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/02/medley-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/DpDijTGyTDY?wmode=transparent",
    "instructions": "I designed the Passing Medley as a drill to work on multiple types of passes, both standing still, and in motion. This can be a great drill if you’ve got the right group of players. However, there are quite a few possible “points of failure.” So, if you’ve got a less-experienced team, or a wide range of skill levels from top to bottom, this might not be the optimal passing drill for you. Here’s the diagram:\nPassing Medley1. player leaves corner and picks up pass from his line2. after receiving the pass, he passes to (P) in the corner and gets it back3. executes give and go with (P) on the blue line, then shoots4. Players rotate as shown\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Passing: Extreme Passing Kit",
    "url": "https://weisstechhockey.com/passing-extreme-passing-kit/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/08/DSC_0020.jpg",
    "video_url": "https://www.youtube.com/embed/3CyM_PjzeZo?wmode=opaque",
    "instructions": "Passing is a skill that most players don’t think about working on away from the rink. The main reason they don’t think to work on passing is pretty obvious: because you need a partner to pass to, and to receive passes from… Unless, of course, you have the Extreme Passing Kit.\nOverview:The Extreme Passing Kit is a really cool skill pad & passing rebounder combo, that will let you work on multiple skills such as regular passes, touch passes, and one-time shots.\nThe Extreme Passing Kit comes in two different models, theOne-Timer Model(which you see in this video), and theBungee Cord Model. The only difference between the two is that the rebounder is removable in the One-Timer Model, and can be mounted onto anothershooting pad, or even yourdryland flooring tiles. This feature gives you a little more flexibility than you have with the Bungee Cord Model.\nOn the Bungee Cord Model, the rebounding bungee is mounted right onto the skill pad, making the unit completely self contained (which has it’s benefits as well, in my opinion).\nBoth models use the4×8′ roll-up shooting pad(huge!), which is light weight, durable, and portable. You can easily roll it up for storage when you aren’t using it, or pack it in the car to bring it to a new dryland training location.\nMy Experience:The Extreme Passing Kit comes already rolled up for you. When I first unboxed mine, it had retained the shape of being rolled up (which is to be expected), and I had to sort of “pry” it open and “reverse roll” it a bit on the ends to keep it from rolling back up on me. I let it sit out on my driveway in the hot sun for about an hour, and it flattened right out.\nOnce the shooting pad had flattened out, I mounted the rebounder to one end (it just clamps on), and went to town!\nOne thing you’ll notice about the Extreme Passing Kit is that it works really well with pretty much any type of puck. I’ve used mine with regular black pucks, FlyPucks, and Green Biscuits, all of which slide really well, and stay flat off the rebounder. In fact, the pucks stayed flat enough that I was actually able to work some one-touch passes as well (which actually surprised me a little).\nConclusion:In conclusion, theExtreme Passing Kitis definitely a worthwhile product to add to your Home Hockey Training Center. It is well built, versatile, portable, and the surface area of the skill pad is big enough to use it for shooting, stickhandling, or passing.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Perpetual Cycle",
    "url": "https://weisstechhockey.com/hockeycyclingdrills/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/perpcycle-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/mhstm9IyhhI?wmode=transparent",
    "instructions": "I’ve used this drill for a number of years, and its a fun one! Start by teaching your players the basic fundamentals of cycling, you might try ourCycle Give and Go Drillto get them started. Once they’ve got the hang of it, run this one for more advanced development. Here’s the diagram and explanation:\nPerpetual Cycle1. Coach dumps a puck in – first player goes into corner, picks up the puck, and cycles it back.2. A second player follows him in to pick up the cycle.3. After cycling it back, the first player cuts across the top of the circle and drives the net – second player passes out for a one-time shot.4. After the pass is made, the next player in line dumps it in the other corner.5. The player who just made the pass continues up around the top of the circle, then drives into the corner to pick up the dump.6. He cycles back, and the player who dumped it in supports to pick up the cycle. Same thing happens again. Drill continues perpetually.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Perpetual Power Turn and Passing Drill",
    "url": "https://weisstechhockey.com/perpetual-power-turn-and-passing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/01/perppowerturn-1024x559.jpg",
    "video_url": "",
    "instructions": "Use this drill to work on power turns, passing, and certain timing and support concepts with your youngsters. When done well, it’s a quick-paced drill that works on some of the key fundamentals that are important in the game of hockey.\nPerpetual Power Turn and Passing\n1. Run both sides at the same time\n2. Drill starts with a “ghost man” (Gh) in each corner. After the first rotation the Gh isn’t needed anymore\n3. Players follow the sequence executing power turns and passes as shown\n4. After the last turn, the outside man drives wide and shoots\n5. Inside man starts the drill going the opposite direction as the wide man\nEnjoy!!\nCLICK HEREfor a PDF of the Perpetual Power Turn and Passing Drill",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Power Turn Give & Go",
    "url": "https://weisstechhockey.com/power-turn-give-go/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2017/01/power-turn-give-and-go-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/hqRTQ9yd1U4?wmode=transparent",
    "instructions": "Awesome drill for working on controlling the puck through a power turn. After going through simulated traffic, players explode out for a give & go pass with coach.\nPower Turn Give & Go:1. Power turn through the cones2. Give & Go with Coach3. Drive Wide, and Attack the Net",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Power Turn Progression",
    "url": "https://weisstechhockey.com/power-turn-progression/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/08/powerturn_progression.jpg",
    "video_url": "https://www.youtube.com/embed/JmJ66BnLhBs?wmode=transparent",
    "instructions": "This is the progression I use when developing power turns with my players. Remember, to work on skill development, you must 1. Show the Skill, 2. Develop the Skill, 3. Apply the Skill. Here’s the diagram and explanation:\nPower Turn ProgressionPlayers set up as shown. Designate which direction ALL lines will be turning toward. Lines 1 & 2 go at the same time, lines 3 & 4 go at the same time.\nPhase 1:Player skates out to the cone, power turns, and explodes back to the line. Run each player through 3-4 times, then switch the direction of the turn.\nPhase 2:Same as phase 1, but with the puck. Add a shot.\nPhase 3:Inside edges through the cones, power turn out, and explode in for the shot. Run each player through 3-4 times, then switch the direction of the turn.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Rick O'Shay Hockey Targeting System",
    "url": "https://weisstechhockey.com/rick-oshay-hockey-targeting-system/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2013/02/DSC_0001.jpg",
    "video_url": "https://www.youtube.com/embed/n4tF7zRMQAI?wmode=transparent",
    "instructions": "The Rick O’Shay is a great hockey targeting system that gives an alternative perspective to the conventional “Shooter Tutor” style, roll-up canvases. Since it’s a 3D mold, there are endless rebound possibilities, which makes for a much more realistic scrimmage experience.\nConstruction:The Rick O’Shay is made of super durable plastic, which will hold up to your hardest shots. In addition to being durable, it is also very light weight, and can be separated into halves, which makes it easier to transport. The Rick O’Shay is fastened to the net with bungee cords that fit between molded channels, which provide a shield against shots.\nDesign:The most obvious difference between the Rick O’Shay and most other hockey targeting systems is the fact that the Rick O’Shay is a 3-dimensional model. This design gives a more realistic shooting experience, and provides for infinite rebound possibilities. One of my favorite design features is the glove pocket. If you’re trying to go upper right, and miss, your puck might land in the goalie’s glove, stopping play while you fish it out. The Rick O’Shay also features a more “up-to-date” hole set-up, which more closely resembles the open areas you’d see against a butterfly goalie.\nUsability:All in all, the Rick O’Shay is a great targeting system, and is especially useful in drop-in situations where goalies can be scarce. It’s not quite as portable as a roll-up target, but it’s much more realistic. So it could be a great option if portability isn’t a huge deal to you.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Serpentine Drill",
    "url": "https://weisstechhockey.com/serpentine-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2014/02/serpentine.jpg",
    "video_url": "https://www.youtube.com/embed/xzFARZTiv-M?wmode=transparent",
    "instructions": "The Serpentine Drill is a great progressional drill if you’ve been working on power turns. This drill develops power turns with the puck, and can incorporate some passing and shooting as well. Here’s the diagram and explanation:\nSerpentine Drill1. Players line up as shown2. Puck carrier drives deep, power turns around the low cone, and explodes up ice3. Puck carrier passes to next player in line, then loops around the high cone4. Next player passes back to the receiver, then skates up to the center line, picks up a puck, and starts the drill over",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Shooting: My Favorite Off-ice Shooting Drill",
    "url": "https://weisstechhockey.com/shooting-my-favorite-off-ice-shooting-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/05/DSC_0073-1024x682.jpg",
    "video_url": "",
    "instructions": "When I was in high school, we had ahockey net and backstopout in my parents’ side yard. We also had aShooter Tutorstrapped up to the net, with about100 pucks. Almost everyday my buddy and I would shoot pucks together. To keep it entertaining, most of the time we’d play a game called P.I.G.\nP.I.G. is really fun, and can be played on or off the ice. Here’s how it works…\nThe Rules:P.I.G. works a lot like H.O.R.S.E. in basketball, except that it’s a shorter game, so it’s a little more intense. Basically, a player calls his or her shot. The shots can be any typical shot, or you can get creative and start calling posts or crossbar, forehand, backhand, or even specifying shot type. If that player makes the shot, then the other player has to match it. If the other player misses, he or she gets a letter.\nThe player who called the first shot keeps calling shots until he or she misses the called shot (you don’t get a letter if you miss your own called shot). At that point it’s the other player’s turn to call a shot, and the process repeats itself.\nYou get two chances on the last letter.\nIn this video, my good friend Brett Fuller and I play a high-stakes game of P.I.G., to make it a little more interesting, the loser has to ride the bull (Happy Gilmore style) on camera. With so much on the line, neither of us wanted to lose!\nI love putting a little additional pressure into practice drills––even off the ice! It gets you used to performing in clutch situations. Putting something embarrassing on the loser is definitely a fun way of doing this!\nYou’ll notice, 5-hole was giving us both a hard time in this video, and proved to be the game winner! Enjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Skating: PowerSlide Hockey Slide Board",
    "url": "https://weisstechhockey.com/skating-powerslide-hockey-slide-board/",
    "image_url": "",
    "video_url": "https://www.youtube.com/embed/0QLW960hKmc?wmode=opaque",
    "instructions": "A while back I was talking to one of my coaching buddies about some of the cool off-ice training equipment that is available these days. I mentioned something about combining ahockey slide boardwith astickhandling skill pad, and how it would be cool to be sliding back and forth while stickhandling, passing, shooting, or anything else.\nAt the time I thought my idea was completely original… but, it turns out that innovative hockey coaches have had their players doing this for years!\nWhat You Get, and Set-up:So… here’s what I did. I picked up the PowerSlide slide board from HockeyShot. It’s a really high quality slide board that is portable, so you can take it places; adjustable, so you can use with athletes of various sizes and abilities; durable, so it’ll hold up to a lot of usage; and super grippy, so it won’t slide around on you.\nThe first thing I did was watch the free DVD that came with the PowerSlide. The DVD was very helpful for instructions on putting the PowerSlide together, but the exercise instructions and demos were a little weak to be totally honest. You’ll be better off just using your own creativity to develop your own set of exercises. Plus, as a hockey player or coach, I’m sure you’ve got no shortage of skating drills that can be transferred to the PowerSlide!\nSet up was a breeze. I unrolled the PowerSlide, attached the adjustable end piece so that it was a good length for me, tightened it down, and I was all set.\nThe PowerSlide consists of two end-piece assemblies (where you’ll be pushing off from), and a flexible slide mat. There’s an interesting design feature that I quite like on the PowerSlide. The end piece assemblies aren’t just flat, like most other slide boards. They are made using solid rubber “ramps” that enhance the grip underneath the slide board, and improve the pushing angle of your stride. This feature allows you to stride really hard, but stay very stable in the process.\nThe PowerSlide also comes with a carrying bag, and a set of booties to wear over-top of your shoes.\nMy Experience:I decided to use my PowerSlide on top of my Dryland Flooring Tiles, which gave me tons of room for stickhandling and passing. It worked REALLY well! The only thing that surprised me was that the PowerSlide was SO grippy that they were causing the Dryland Tiles to shift a little bit against the garage floor!\nOnce I slid the tile set-up into the corner, it anchored itself down a bit better, and I didn’t slide anymore.\nUsing the PowerSlide was amazing… not only was it a lot of fun, but it was a FANTASTIC workout! In fact, you can see a bit of sweat on my face at the end of my video review 🙂 What’s even better though, is that it felt A LOT like the real thing. I was able to work on all sorts of skating, passing, and stickhandling combos, all in the “comfort” of my own garage!\nConclusion:This was one of the funnest, most realistic set-ups I’ve had the chance to mess around with, and I definitely recommend adding this to your Home Hockey Training Center.\nIf you decide to pick up the PowerSlide, I would HIGHLY recommend grabbing a few other items while you’re at it… Here’s a quick list for you:\nYes, you’ll spend a bit more upfront, but it will make your experience a lot more worth while in the long run.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Spice 2 Shot Warm-Up Drill",
    "url": "https://weisstechhockey.com/spice-2-shot-warm-up-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/01/spice2shot-1024x559.jpg",
    "video_url": "",
    "instructions": "This is another nice warm-up drill that incorporates multiple elements of play, including backward skating, pivots, passing, and shooting. Simple, but effective!!\nEnjoy!\nCLICK HEREfor a PDF of the Spice 2 Shot Warm-up Drill",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Spice Figure 8 Passing Drill",
    "url": "https://weisstechhockey.com/spice-figure-8-passing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/04/fig8passing-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/g4pNCpc-7x4?wmode=transparent",
    "instructions": "I love this hockey passing drill because it just flows well––especially when you have the right group of players for it. At it’s best, this is a quick-paced, “tic-tac-toe” type of drill. However, if you have the wrong group of players, this drill will grind to a halt pretty quickly. So, just make sure your players are advanced enough before attempting this one! Here’s the diagram and explanation:\nSpice Figure 8 Passing Drill1. On the whistle, one (F) from each line diagonally across from each other goes.2. Each (F) takes a few steps forward, then passes to the far (D).3. The defensemen make a few “D to D” passes, then hit the (F) as he power turns around the far cone.4. After skating the figure 8 as shown in the diagram, (F) picks up the puck, splits the defensemen, and enters the zone for a shot on net.\nEnjoy!!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Stickhandling: Attack Triangle",
    "url": "https://weisstechhockey.com/stickhandling-attack-triangle/",
    "image_url": "",
    "video_url": "https://www.youtube.com/embed/wNOiCIX7tOA?wmode=opaque",
    "instructions": "A number of years ago, one of my coaching buddies told me he had just bought 10 Attack Triangles to use for his team. I took a look, but didn’t totally see the value. I thought it looked a little gimmicky, and it seemed like it would be a hassle to bring that many on the ice each practice.\nIt wasn’t until a couple of months ago that I actually got the chance to use the Attack Triangle, and when I did, I liked it a lot!\nThe TheoryTheAttack Triangleis designed to mimic a defenseman in a 1 on 1 stance. You’ve got the stick and two skates, and they’re positioned exactly where a real player would have them. The fact that it’s a 3-dimensional model makes for a more realistic experience for your players. For example, if you start your move too late, you’ll hit the the stick and lose the puck. If you don’t pull your stick back in time, it’ll get caught up in the Attack Triangle’s stick, and once again, you’ll lose the puck.\nOff-Ice TrainingA big part of effective stickhandling practice is just getting your reps in, plain and simple. This is where off-ice training with a tool like the Attack Triangle can come in REALLY handy. Instead of having a partner stand there, mimicking a defensman’s stance for countless reps, you just set up the Attack Triangle, and go to town. I definitely recommend getting one or two of these for your off-ice training center.\nOn-Ice BenefitsThis training tool can also work in your favor as a coach during practices. In the past, I’ve often had a coach offer “token” resistance in a stickhandling drill, and basically stand in the way, in a defensive stance, and let players make moves around him… maybe you’ve done the same? While this method can work, it’s taking at least one coach completely out of the equation! Now instead of coaching, he’s playing “token defense.” Definitely not the best use of personnel in my opinion. Why not throw down an Attack Triangle and let your coaches be free to coach?\nConclusionTheAttack Triangleis a really good tool, with a lot of possible uses. In my mind, having one or two for your off-ice training center is a no-brainer. It will help you to develop your dekes and moves in ways that are much more realistic. On the ice, I also see many uses for the Attack Triangle. The only question is how likely are you to bring them to the rink and back every practice? If you have a situation where you can leave them safely at the rink somehow, then I’d definitely consider picking up 10-12 to use in place of cones.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Stickhandling: Green Biscuit Review",
    "url": "https://weisstechhockey.com/stickhandling-green-biscuit-review/",
    "image_url": "",
    "video_url": "",
    "instructions": "My First Experience with the Green BiscuitI’ve gotta admit, the first time I saw theGreen Biscuitonline, I didn’t get it. It seemed a little weird, and kinda “gimmicky” to me.\nThen, a few months ago I saw one at my local hockey shop. I picked it up off the counter, and asked Darren, the store owner, what he thought of it. He told me it was amazing, and that he’d never seen anything like it. I’ve been friends with Darren for years, so when he tells me “I’ve never seen anything like this,” I usually perk my ears up! Here are his exact words:\n“Jeremy, that puck is the damnedest thing… it feels EXACTLY like a real puck, even out there on the parking lot. I’ve never seen anything like it! You’ve gotta get out there and let me show you this!”\nSo we grabbed a couple of old sticks from the back and went outside to the parking lot. Darren was right! TheGreen Biscuitdid behave just like a real puck. In fact, I’d NEVER seen a puck stay so flat while passing across such a bumpy surface. We messed around in the parking lot for a bit. The more I used the Green Biscuit, the more impressed I became with it… I started passing harder and harder, trying to “test the limits” of the puck. I was thinking at higher passing speeds, it would surely skip up if it hit a rock or something. Nope! It just stayed flat.\nAfter a few minutes of really zinging it back and forth, Darren told me to try throwing some sauce. So of course, I took the invitation… once again, I was amazed. I threw Darren a saucer pass, and the Green Biscuit floated nice and flat through the air, then hit the ground AND STUCK! Before long, Darren and I had spread way out, and were firing saucer passes across the parking lot at each other. Needless to say, I was sold.\nDissecting the Green BiscuitThe reason the Green Biscuit works so well is because of the design. It’s about the same size as a regulation puck, but it’s about an ounce lighter (when friction is factored in, it feels about the same as a regulation puck feels on the ice). Next, the middle is recessed, so contact points with the surface are minimized. In fact, you can see the wear marks on my puck cover about a 2 mm area around the outer edge of the puck.\nThe most interesting design element is the Green Biscuit’s two-piece, “hinged” assembly. Three metal dowels hold the two halves of the green biscuit loosely together. There are foam cushions in the middle that dampen any bumps. This set-up acts a lot like shock absorbers in a car, with the bottom half of the puck having the flexibility of “adjusting” to the bumps in the surface.\nConclusionThis is a really fun puck to mess around with. If you have the chance, take theGreen Biscuitout and give it a whirl. It’s so much fun to use, you might lose track of time once you get passing it around (that’s what happened to me at least!). I had so much fun shooting the footage for this video review, that I took a lot longer to make it than I needed too. It’s a great puck to use for stickhandling on just about any surface, and it’s even more impressive when you start working on passing. I definitely give the Green Biscuit two thumbs up!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Stickhandling: SmartHockey Ball Review",
    "url": "https://weisstechhockey.com/stickhandling-smarthockey-ball-review/",
    "image_url": "",
    "video_url": "",
    "instructions": "Every once in a while a hockey product comes along that just makes sense. TheSmartHockey Stickhandling Ballis one of those products. I’ve been using the Smart Ball for about 7 years now, and I’ve really enjoyed it. There are a few reasons why the Smart Ball is such an effective stickhandling tool.\nVersatility and DurabilitySince it’s a ball, the Smart Ball can be used on many different surfaces. You can take it inside and use it on carpet, bring it to the rink and use it on the rubber flooring there (I keep a Smart Ball in my bag to use for warming up my hands before games), or you can use it outside on the pavement. The Smart Ball is durable enough to withstand whatever abuse you might throw at it. In fact, I still have my original Smart Hockey Stickhandling Ball that I bought 7 years ago, and it’s still in GREAT shape. These balls just don’t wear out!\nSmart DesignThe Smart Hockey Ball really lives up to its name when it comes to it’s design. They really did their homework with this product. Here are a few of the key features that I think really add to the off-ice stickhandling experience of the Smart Ball:\nConclusionAll in all, this is a fantastic ball to add to your stickhandling tool set. Not only is it extremely versatile, durable, and well-designed, but it’s a lot of fun to use too, which means it’ll actually GET used! I recommend picking up 2 or 3Smart Balls, one for your bag, and a couple to have at home in your dryland area.\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Stickhandling: Swedish Wooden Ball Review",
    "url": "https://weisstechhockey.com/stickhandling-swedish-wooden-ball-review/",
    "image_url": "",
    "video_url": "",
    "instructions": "In most areas of athletic development there are drills and products to work on raw strength, and there are drills and products designed to work on speed and agility. Think of the difference between a boxer punching the heavy bag vs. the speed bag, or the difference between squats and sprints. Well, stickhandling is no different.\nWe use different pucks, balls, and other training tools to work on different aspects of stickhandling skill requirements, in an attempt to put together a “complete development package” that will help the athlete to perform at an optimal level.Heavier pucks and ballswill develop wrist and forearm strength, whilelighter ballswill develop faster hands, and quicker reaction speed. Both types of training are important.\nWhy it Works:TheSwedish Wooden Ballwas designed help you work on your quick hands. This ball is substantially lighter than a puck, and since its made out of wood, it gives you a real dead bounce, which is what we’re looking for in a hockey training puck or ball.\nSince it’s a ball, you’ll be able to use it in more places than with a puck (think rubber flooring at the rink, carpet inside your house, pavement, concrete, etc.) This is a very versatile product.\nConclusion:This is a great, inexpensive tool that will give you some variety in your stickhandling training. I recommend picking up two or three of these balls. One for your hockey bag, and a couple to keep around the house. Then all that’s left is to get creative with it!\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Stickhandling: SweetHands",
    "url": "https://weisstechhockey.com/stickhandling-sweethands/",
    "image_url": "",
    "video_url": "https://www.youtube.com/embed/ykIXpmaN2VI?wmode=opaque",
    "instructions": "If you’ve been following along with our Home Hockey Training Center course, you probably know by now thatversatilityis one of the biggest selling points for me when it comes to selecting hockey training products. I like products that will give me multiple uses, and that can be combined with other products to make an even more creative “work space.”SweetHandsdefinitely fits that criteria!\nFeatures and BenefitsHere are a few of the SweetHands features I thought were noteworthy:\nMy ExperienceSetting up your SweetHands is easy. The pieces just snap together, and you’re up and running in seconds. I liked being able to choose how many pieces to include in my set-up. As you see in the video, I messed around with a few different combinations to work on different aspects of stickhandling.\nI also like how durable this product is. I had seen some durability demos on other videos (kids stepping on the SweetHands “crossbars” with skates), but I wasn’t planning on actually putting hat to the test… However, my rambunctious 4-year-old thought otherwise. I caught him walking tightrope style across the SweetHands unit, AND jumping up onto the crossbars like plyo jumps, and trying to land and balance on them! I’m happy to report, the SweetHands held up to the abuse just fine.\nSweethandsis a pleasure to use. It works really well, and does exactly what it was designed to do. As I was making the video, I kept thinking how much better a stickhandler I would be if I would have had some of these tools available to me as a kid!ConclusionI had a lot of fun putting this post together. SweetHands is a great product, with lots of versatility, and the capability of making you a better hockey player if you use it consistently. It’s lightweight, portable, and easy to put together and take a part.\nThe drill book and DVD are two added bonuses that are VERY worthwhile! In fact, if it were sold separately (which it’s not), I’d recommend picking up the DVD even if you didn’t get theSweetHandsunit itself, it’s that good! I definitely recommend this product to anyone looking to improve their stickhandling off the ice!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Swedish 5-Pass & Shot",
    "url": "https://weisstechhockey.com/swedish-5-pass-shot/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/swedish_5-pass.jpg",
    "video_url": "https://www.youtube.com/embed/0hyYjZ6FXyQ?wmode=transparent",
    "instructions": "The Swedish 5-Pass & Shot drill is a great way to work on some of the passing and skating patterns used in regroups. This is a more advanced drill, so make sure you have the right group for it before giving it a try. Here’s the diagram:\nSwedish 5-Pass & Shot\n1. On whistle, first player from each diagonal line leaves without a puck (only one line shown here to keep the diagram simple)2. First player skates across the blue line, receives a pass from the second player of the opposite line, then touch-passes it back3. After passing it back, he or she loops around the top of the center-ice circle, receives a pass from the same line he or shee left from, then touch-passes it back4. After the second touch pass, player loops out wide, opens up as an outlet pass, receives another pass from the same line he/she left from, and attacks 1 on 0\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Synchronized Passing Drill: Improve Full-Speed Passing Skills Without Breaking Stride",
    "url": "https://weisstechhockey.com/synchronized-passing-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2008/10/Synchronizes-Passing-Full-Ice-1024x490.png",
    "video_url": "https://www.youtube.com/embed/05di0WHx404?feature=oembed",
    "instructions": "In the world of hockey, mastering the art of passing is critical. Smooth, effective passing can make the difference between a successful play and a missed opportunity. In this guide, I’ll walk you through a quick, simple, yet effective passing drill called “Synchronized Passing.” This drill can be applied to players of all ages and skill levels. Moreover, it offers several variations to keep practices dynamic and challenging.\nSynchronized passing aims to teach players to give and receive passes smoothly without breaking stride. The essence of this drill is maintaining close distance between players to ensure precise and efficient passing. You’ll want to focus on moving the puck “tape to tape”—meaning your passes are hitting the sweet spot of your teammate’s stick every single time. As players get better, the drill can be modified to incorporate more distance and different types of passes.\nAs players become adept at synchronized passing, you can add a shot to the drill for an added layer of complexity:\nButterfly passing is a more advanced iteration of synchronized passing:\nWhile there is value in teaching players to use their backhands, long cross-ice passes on the backhand are low-percentage plays even in professional hockey. For this reason, emphasize sniping hard, accurate forehand passes during the butterfly drill.\nThe cornerstone of synchronized passing is achieving seamless puck movement. Strive for smooth, uninterrupted strides paired with crisp, accurate passes.\nIntroduce variations such as changing pass types, increasing distances, or incorporating more shots to keep the drills engaging and challenging. This approach ensures players remain focused and constantly improve their skills.\nSynchronized passing is a vital drill for hockey players aiming to refine their passing game. By focusing on close-quarters passing, adding shooting components, and progressing to more complex configurations like butterfly passing, players can significantly enhance their skill set. Mastering these drills not only contributes to individual player development but also fosters better teamwork and communication on the ice.\nFor more drills, skills, and resources, be sure to keep up with Weiss Tech Hockey’s blog. Whether you’re a coach or a player, continuous practice and dedication to mastering the fundamentals are key to excelling in hockey. Happy training!\nCLICK HERE TO PURCHASE (use code JWEISS15 for 15% off at checkout) >>\nJeremy Weiss (with his translator) presenting at a hockey coaching symposium for the Russian Federation in Moscow—2018.\nHockey coach and international consultant, Jeremy Weiss, has worked with thousands of coaches worldwide since 2008 to help produce championship teams at every age and skill level.\nHe is known internationally through the work he has done online. In 2008 he invented “digital chalktalks” which combined screen sharing with drill diagramming software, to produce a training experience nobody had ever seen before. His YouTube following quickly grew to over 19,000 subscribers, and he has produced over 130 training videos.\nJeremy runs a development blog for coaches, which has over 280 posts. He is the author of 10 hockey books for coaches, and is the editor of Hockey Development Magazine.\nHe was trained in the Eastern European style as a pre-teen, by his Czechoslovakian skills coach, and competed internationally as a “Wexford Raider” among the top youth hockey programs in the world including Russia, Czechoslovakia, Finland, and top teams in his home province Ontario, Canada.\nHe majored in Exercise Sciences at Brigham Young University, and subsequently worked as a Personal Trainer, where he continued to study and develop ideal training methods for hockey.\nHe has incorporated the very best pieces from the various training styles he has been involved in, and has built a world-class off-ice strength and conditioning program that fits the specific needs of hockey players.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Timed Delay Drill",
    "url": "https://weisstechhockey.com/timed-delay-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2010/11/timeddelay-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/VGdGRmJ4wTI?wmode=transparent",
    "instructions": "Passing and timing are extremely important concepts for hockey players to understand. This is a drill you can use to introduce these ideas at a young age. As is the case with many drills, you can progress this through from simple to more complex versions as your players progress.\nThe first part of this drill develops basic passing and timing skills, the second part can be progressed to work on attacking the offensive zone in “waves,” meaning if the first attack option is shut down, a player can “delay” by misdirecting, then wait for his trailer man to come in late. Here’s the diagram:\nTimed Delay Drill:1. First player in line walks in and shoots, then picks up a puck from the corner.2. Second player in line times it, then explodes as first player is ready to make the pass.3. After receiving the pass, second player drives wide, then delays with a misdirection toward the boards4. First player times it to cross the blue line as the second player is coming out of his misdirection.5. First player picks up the pass and shoots.\nNOTE: Run from both sides of the ice at the same time.\nEnjoy!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Warm-up Pass Exchange",
    "url": "https://weisstechhockey.com/warm-up-pass-exchange/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2011/01/exchange-1024x559.jpg",
    "video_url": "",
    "instructions": "This is a cool little drill that incorporates a lot of different elements such as puckhandling, forward skating, backward skating, pivots, crossovers, passing, and shooting. It can be run at a quick pace, making for limited “stand-in-line” time.\nWarm-Up Pass Exchange:\n1. Players line up in opposite corners, with pucks\n2. Players skate the diagrammed route, pivoting backwards between the blue lines\n3. Players exchange pucks in neutral ice, then step in and shoot.\nNote: make sure to run from both sides so players work on pivoting both directions\nEnjoy!!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Weiss Tech Coaching Clinics: On-Ice Skill Development in Action",
    "url": "https://weisstechhockey.com/weiss-tech-coaching-clinics-on-ice-skill-development-in-action/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2015/08/CJ_V6555-1024x683.jpg",
    "video_url": "https://www.youtube.com/embed/FT33xBTQKow?wmode=transparent",
    "instructions": "We recently published Part 1 of a video series designed to help coaches formulate their on-ice development processes with their teams. Over the past 4 days since the video went live, we’ve received a lot of AWESOME feedback from our coaches. Here are a few examples of emails that have come in:\nGreat video as always! Well presented, well organized and well explained.\nGood video and topic. Far to many coaches lose patience when teaching for skill acquirement. They see the players struggle and not understand what it is they are trying to teach them. […] Thanks again for putting the video out and I am looking forward to your Coaching Clinic.\nThis is great stuff!  I really liked this video explaining the use of progressions. I am really pumped to participate in your clinic!  I’m always craving more knowledge.\nJust watched part 1. Well done,  I know that these videos and topics you will be discussing will be very helpful to me.\nI would like to personally thank you for this detailed break down, it will be very useful this September for me. […] Thank you very much. if you’ll ever come in Italy i’ll buy you a drink 😉\nThere were many more, just like these. Thank you for your feedback!\nThe purpose of this series is to give you a sample of the type of instruction you can expect in our upcoming clinics; and to give you some useful content in the process!\nIf this video was helpful, make sure you get on our email list so you’ll be sure to be in the loop as we get closer to the registration date for the clinics.\nEnjoy!\nJeremy",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Wiseman Drill",
    "url": "https://weisstechhockey.com/drill-wiseman-drill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/wiseman-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/g9yThOWaEIQ?feature=oembed",
    "instructions": "The “Wiseman Drill,” named after one of my old coaches, is a great passing and timing drill (one of my favorites!). This drill incorporates many game simulation concepts such as one-touch passes, timing, support, offensive attack, and odd-man rushes. Furthermore, there arenumerousvariations and options you can work through with your team. So be creative, and have some fun with this one!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "X-Deviator Hockey Stickhandling Aid",
    "url": "https://weisstechhockey.com/x-deviator-hockey-stickhandling-aid/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/10/DSC_0060.jpg",
    "video_url": "https://www.youtube.com/embed/hUS3aaLoXtg?wmode=opaque",
    "instructions": "I’ve mentioned this before, but there are a number of skills that can easily be developed off the ice. I’m a strong believer that players who don’t take advantage of off-ice training time are leaving precious skill development on the table. Stickhandling is one of the easiest skills to work on at home.XHockeyProductshas put together a great line of hockey training aids that is both fun and effective, which means players will be more motivated to work on their skills off the ice!\nThe X-Deviator:TheX-Deviatoris a new take on hockey stickhandling aids. The biggest difference between the X-Deviator and some of the other stickhandling aids out there is that the X-Deviator is adjustable. Each joint on the X-Deviator swivels, this feature opens the door for increased creativity by allowing for an endless variety of configurations.\nSize Options:The X-Deviator is available in two sizes; Standard – 7 segments, and Mini – 3 segments. Either can be used on or off the ice. Pick the one that fits your needs and matches the space you have available.\nIntegration with the X-Line-up:The X-Deviator is part of theX-Line-up. All of the products in the X-Line-up are designed to be used together, and can be configured to work on whatever skill you’re looking to develop. If you already have (or plan to purchase) the X-Tiles, make sure you pick up an X-Pocket to go along with your X-Deviator. The X-Pocket will allow you to hook up your X-Deviator right into your X-Tiles system.\nConclusion:I’ve been a big fan of XHockeyProducts’ X-Line-up for a long time, and the X-Deviator didn’t disappoint! The concept is fantastic, and the product is well put-together. One minor word of advice would be to make sure to tighten the nuts that hold the segments together from time to time. They can get loose from using the X-Deviator and changing configurations. If the nut falls off, the segments come apart. Not a huge deal, but just something to watch out for. All in all, another great product from XHockeyProducts!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "X-Passer Hockey Passing Rebounder",
    "url": "https://weisstechhockey.com/x-passer-hockey-passing-rebounder/",
    "image_url": "",
    "video_url": "https://www.youtube.com/embed/J4vQfZijsR0?wmode=opaque",
    "instructions": "Over the past few years, a number of Hockey Passing Rebounders have made their way to the off-ice training market. These rebounders offer many fun and effective ways of working on your passing both on and off the ice, and I highly recommend owning one.\nThe passing rebounder I want to show you in this post is by far and away the best one on the market today. TheX-Passeris a heavy-duty, versatile passing rebounder, that has improved on some of the design flaws of other rebounders that are currently on the market. It’s a lot of fun to use, and it works REALLY well. I’m excited to show you what this is all about, so let’s jump straight in!\nFirst Impressions and Design Features:The first thing that struck me about the X-Passer was it’s weight. This thing is heavy duty! It’s obvious that XHOCKEYPRODUCTS intended this to be used with real pucks, and full-speed passes. The weight and design of the X-Passer make it so you can literally throw it down in the middle of the floor, and fire hard passes at it… and it won’t move around on you. This feature allows you a lot more placement and configuration options, and definitely beats the “clip on” rebounders!\nNext, theX-Passeruses a bungee system as its rebounding mechanism. This helps to keep the rebounds true and flat. In fact… it’s almost impossible to have a puck flip up on you, even with HARD passes (something other rebounders have been known to have issues with). So long as you’re sending it in flat, it will always come back at you flat and hard.\nThird, the X-Passer has a “retractable spiking system” which allows for easy conversion for on-ice use. All you do is twist the screws in the top of the X-Passer, and spikes pop out the bottom. This feature can open up all kinds of new doors for creativity in practices!\nUsing the X-Passer:The X-Passer is a blast to use. It’s a lot of fun when things “just work” the way they’re supposed to. I use the X-Passer to work on pretty much every type of pass; forehand and backhand “cushion and sweep,” touch passes, you can even get creative and combine it with other products to work on your saucer passes!\nConclusion:A few people have asked me if the X-Passer is worth the higher price when compared to some of the other, “cheaper” rebounders on the market. In my mind, if you’re serious about your off-ice training, it’s absolutely worth paying a premium for a product that is going to work the way it’s supposed to, and last as long as you’ll need it to. When you pick up yourX-Passer, that’s exactly what you’re getting!",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "X-Tiles Flooring System",
    "url": "https://weisstechhockey.com/x-tiles-flooring-system/",
    "image_url": "",
    "video_url": "https://www.youtube.com/embed/rWZKZTOsu8Q?wmode=opaque",
    "instructions": "I was recently introduced to a new hockey dryland tile that I’m really excited about. It’s called the X-Tile, and it’s made by XHockeyProducts (yes, the same company that brought you the X-Passer, and the X-Deviator).\nIf you’re familiar withXHockeyProducts, you already know they are famous for designing heavy duty, smart, & functional hockey training equipment… and this product is no different!\nThe X-Tiles are not only an awesome flooring product to give you a slick surface for stickhandling, shooting, and passing, but they’re also a fully integrated, hockey training system that works in tandem with many other products! In this review I’ll be showing you how the X-Tiles work, and sharing my experiences with them.\nUnboxing:\nMy first impression of the X-Tiles was that they are actually a really good weight. You don’t want a product like this to be too flimsy, but at the same time, you don’t want it to be too hard to move around. The X-Tiles are a durable, manageable weight.\nSize:\nThe next thing you’ll notice about the X-Tiles is that they’re huge (2 feet by 2 feet!). I always say “the bigger, the better” when it comes to flooring tiles because you want to have the fewest seems possible.\nAssembly:\nThe X-Tiles are REALLY easy to put together AND take a part. This is a big feature in my opinion because it allows for a degree of portability, and gives you the option to change configurations if you want (a feature I have made use of a few times myself).\nThe easiest way to put together your X-Tile set-up is to lay it out first to get an idea of where everything is going to sit, then tap it all together with a rubber mallet. In the video above, I put together a 15 tile set-up in about 11 minutes.\nAdd-ons:\nOne of the coolest features with the X-Tiles System is that you can add on various pieces of equipment to enhance your experience and work on different skills. Here’s a quick list of add-ons you’ll want to consider:\nExperience:\nAs you can see in the video, using the X-Tiles System is A LOT of fun! The tiles are very slick, the seams are very flat, and the pucks slide well on them. The add-ons work really well, and are fully integrated with the tile system. I like the fact that you can easily change configurations or add to your X-Tiles system over time.\nThe X-Tiles are also pretty “kid proof.” I’ve had my boys using these things every day, and they’ve held up just fine. My kids love it!\nConclusion:\nThis is definitely a product I stand behind. If you’ve got it in the budget, I’d pick up a few boxes of X-Tiles right up front, along with all the add-ons (check out theWeiss Tech Hockey PackageXHockeyProducts has put together). It’s a fantastic training system that is unlike anything else out there. However, the beautiful thing is that you ARE working with a budget, you can just as easily start basic and then keep adding to it piece by piece as you have the funds.",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "ZigZag Touch Pass - Quarter Ice",
    "url": "https://weisstechhockey.com/zigzag-touch-pass-quarter-ice/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/01/Screenshot-2019-01-30-14.17.13-1024x547.png",
    "video_url": "https://www.youtube.com/embed/T6gSZO7PI0Q?feature=oembed",
    "instructions": "I came up with this as a modification to theCircle Passing Drill, which I shared last week. Use this variation if you’re working with a condensed ice situation, like half ice or quarter ice.\nDOWNLOAD PDF PRINTOUT HERE",
    "teaching_points": "",
    "category": "Individual Skill Drills",
    "source": "weisstechhockey"
  },
  {
    "title": "Full Speed Power Play Passing Sequence",
    "url": "https://weisstechhockey.com/full-speed-power-play-passing-sequence/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2012/07/pp_passing_sequence.jpg",
    "video_url": "https://www.youtube.com/embed/1BA88FbShnU?wmode=transparent",
    "instructions": "I use the Full Speed Power Play Passing Sequence to simulate the patterns and passing lanes players will see in game situations. The idea for this drill is to instill the mindset of “Set-up, Attack, Rebound, then back to Set-up.” All executed at top speed. Here’s the diagram and explanation:\nFull Speed Power Play Passing Sequence\n1. Player’s line up in proper position for your team’s power play set-up (in this case it’s the “hybrid” set-up)2. Place cones in positions where the opposing defenders will likely be3. Work through your attack options, in order from highest probability to lowest4. Focus on running through “set-up, attack, rebound, and back to set-up,” with crisp passes, always executing at full speed\nEnjoy!",
    "teaching_points": "",
    "category": "Offensive Zone",
    "source": "weisstechhockey"
  },
  {
    "title": "Quarter-Ice Perpetual Cycle",
    "url": "https://weisstechhockey.com/quarter-ice-perpetual-cycle/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2019/03/Screenshot-2019-03-06-21.26.23-1024x495.png",
    "video_url": "https://www.youtube.com/embed/vPvisUll0_k?feature=oembed",
    "instructions": "I developed this drill as a modification to thePerpetual Cycle Drillwhen working in smaller spaces, or when your group is too large to keep everyone moving in the original version.\nDOWNLOAD PDF PRINTOUT HERE",
    "teaching_points": "",
    "category": "Offensive Zone",
    "source": "weisstechhockey"
  },
  {
    "title": "Small Area Games: Triangle 1-Timer",
    "url": "https://weisstechhockey.com/hockey-small-area-games-triangle-1-timer/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/09/triangle1t-1024x559.jpg",
    "video_url": "",
    "instructions": "This is a fast-paced, small area game drill that incorporates a lot of one-touch passes and one-timer shots. Works REALLY well with the right group of players. Encourage your players to move the puck quickly and isolate the man.\nTriangle 1-Timer:\n1. Players are confined within the lines of their areas.2. Focus on quick puck movement.3. One-touch passes and One-timers.\nAs always –Click Herefor the printout.\nEnjoy!\nJeremy",
    "teaching_points": "",
    "category": "Small Area Games",
    "source": "weisstechhockey"
  },
  {
    "title": "Spice Rebound Activation",
    "url": "https://weisstechhockey.com/hockeysmallareagamesdrill/",
    "image_url": "https://weisstechhockey.com/wp-content/uploads/2018/08/spicerebound-1024x559.jpg",
    "video_url": "https://www.youtube.com/embed/jE2C5iI8lJc?rel=0&showinfo=0",
    "instructions": "Try using hockey small area games drills to simulate various game situations your players will encounter. This one helps to reenforce shooting and crashing the net for rebounds, as well as odd man play and battles. As always,click herefor the printout.\nSpice Rebound Activation:\n1.andstart on the dots across from each other2.dumps puck in for a 1 on 1 battle.3. As soon as a player gets a shot on net, another man from his team may be activated.4. Player must pass back to next man in line in order to activate the player.5. Activate up to 3 players – play continues until a goal is scored.\nVariation: Try this full ice — start with 3 on 3 then activate up to 5 players.\nEnjoy!",
    "teaching_points": "",
    "category": "Small Area Games",
    "source": "weisstechhockey"
  }
]